import React from 'react';

function AmHtml_7() {
  return (
    <div>
      <div className='ad-container'>  
          {/*  реклама  */}
        </div>

          <h2>Ո՞րն է տարբերությունը HTML-ի և XML-ի միջև:</h2>

   <p>
     HTML (HyperText Markup Language) օգտագործվում է կառուցվածքային վեբ էջեր ստեղծելու համար, որոնք սահմանում են
     էջի բովանդակությունը, որը պետք է ցուցադրվի վեբ բրաուզերում: XML (eXtensible Markup Language) ունիվերսալ է
     նշագրման լեզու՝ տվյալների պահպանման և փոխանցման համար՝ առանց կառուցվածքի սահմանափակումների: Հիմնական տարբերությունը HTML-ի և XML-ի միջև
     այն է, որ HTML-ը բովանդակություն ցուցադրելու համար է, մինչդեռ XML-ը պահելու և փոխանցելու համար է
     տվյալներ՝ առանց կոնկրետ կառուցվածքի հղումների:
   </p>

   <h2>Ի՞նչ նմանություններ կան HTML-ի և XML-ի միջև:</h2>

   <p>
     Երկուսն էլ HTML-ը և XML-ը նշագրման լեզուներ են, որոնք օգտագործում են պիտակներ՝ տվյալների կառուցվածքը սահմանելու համար:
     Երկուսն էլ կարող են մշակվել վերլուծիչների կողմից և մեկնաբանվել՝ տեղեկատվություն ցուցադրելու համար, թեև դրանց օգտագործումը
     և նպատակը տարբեր է:
  </p>

  <h2>Շարահյուսություն</h2>

   <p>
     HTML-ի և XML-ի շարահյուսությունը նման է նրանով, որ նրանք երկուսն էլ օգտագործում են թեգեր՝ փաստաթղթի կառուցվածքը սահմանելու համար:
     HTML-ում շատ տարրեր ունեն նախապես սահմանված թեգեր, մինչդեռ XML-ը թույլ է տալիս սահմանել ձեր սեփական թեգերը:
     HTML-ում թեգերը կարող են գրվել մեծատառերով, փոքրատառերով կամ երկուսի համակցությամբ, մինչդեռ XML թեգերը մեծատառերով զգայուն են:
   </p>

   <h2>Օգտագործում</h2>

   <p>
     HTML-ն օգտագործվում է վեբ էջեր ստեղծելու համար, մինչդեռ XML-ը լայնորեն օգտագործվում է տվյալների պահպանման և փոխանցման համար,
     ինչպիսիք են կազմաձևման ֆայլերը, արտադրանքի տվյալները և այլն:
   </p>

   <h2>Հիմնական շարահյուսական տարբերությունները HTML-ի և XML-ի միջև</h2>

   <p>
     Հիմնական շարահյուսական տարբերություններն այն են, որ HTML-ն ունի բազմաթիվ նախապես սահմանված թեգեր և կառուցվածք,
     մինչդեռ XML-ը թույլ է տալիս սահմանել ձեր սեփական թեգերը և կառուցվածքները: Բացի այդ, HTML-ը հաճախ պարունակում է ատրիբուտներ
     որոնք լրացնում են թեգերը, ինչպիսիք են href-ը {'<a>'}-ում հղումների համար, մինչդեռ XML-ն օգտագործում է թեգեր առանց ատրիբուտների
     տվյալների կառուցվածքը սահմանելու համար:
  </p>

  <h2>Կանխորոշված թեգեր</h2>

  <p>
     HTML-ն ունի բազմաթիվ նախապես սահմանված թեգեր, ինչպիսիք են {'<h1>, <p>, <a>, <div>'}, որոնք սահմանում են վեբ էջի տարբեր մասեր:
     XML-ը չունի նախապես սահմանված թեգեր և կախված է պահանջվող տվյալների կառուցվածքին համապատասխան հատուկ թեգեր ստեղծելուց:
  </p>
{/* Примеры HTML и XML */}

<h2>HTML և XML օրինակներ</h2>


<code>
<pre>
    {`
    <!-- HTML օրինակ -->
    <!DOCTYPE html>
    <html>
    <head>
        <title>HTML օրինակ</title>
    </head>
    <body>
        <h1>Վերնագիր</h1>
        <p>Պարբերություն  <a href="https://example.com">հղմամբ</a>.</p>
    </body>
    </html>
    
    
    <?xml version="1.0" encoding="UTF-8"?>
<note>
    <to>Ստացող</to>
    <from>Ուղարկող</from>
    <heading>Վերնագիր</heading>
    <body>Նշման տեքստը:</body>
</note>
`}
</pre>
</code>

{/* Самозакрывающиеся теги */}

<h2>Ինքնափակվող թեգեր</h2>

   <p>
     HTML-ը երբեմն օգտագործում է ինքնափակվող թեգեր, օրինակ՝ {'<img> կամ <br>'}, մինչդեռ XML-ում յուրաքանչյուր պիտակ
     պետք է հստակորեն փակվի կամ ինքնափակվի:
  </p>

{/* Другие ключевые отличия HTML и XML */}

<h2>HTML-ի և XML-ի այլ հիմնական տարբերություններ</h2>

   <p>
     HTML-ը նախատեսված է վեբ էջի բովանդակությունը ներկայացնելու համար, մինչդեռ XML-ն օգտագործվում է տվյալների պահպանման և փոխանցման համար:
     HTML-ն ունի բազմաթիվ նախապես սահմանված տարրեր և ատրիբուտներ, մինչդեռ XML-ը պահանջում է, որ տարրերն ու ատրիբուտները հստակորեն սահմանվեն:
  </p>

{/* Когда использовать HTML и XML */}

<h2>Երբ օգտագործել HTML-ը և XML-ը</h2>

  <p>
     Օգտագործեք HTML՝ բովանդակությամբ վեբ էջեր ստեղծելու համար, որոնք պետք է ցուցադրվեն բրաուզերում:
     Օգտագործեք XML-ը տվյալների կառուցվածքի և պահպանման համար, որոնք պարտադիր չէ, որ հայտնվեն վեբ էջում:
 </p>
{/* Как использовать HTML и XML вместе */}

<h2>Ինչպես օգտագործել HTML-ը և XML-ը միասին</h2>

  <p>
     HTML-ը և XML-ը կարող են օգտագործվել միասին, օրինակ՝ վեբ էջեր ստեղծելու համար, որոնք բեռնում են տվյալները XML ֆայլերից ցուցադրվելու համար:
     Այդ նպատակով հաճախ օգտագործվում են այնպիսի տեխնոլոգիաներ, ինչպիսիք են AJAX-ը կամ սերվերային ծրագրավորման լեզուները:
  </p>
{/* Краткое изложение основных различий между HTML и XML */}

<h2>HTML-ի և XML-ի հիմնական տարբերությունների ամփոփում</h2>

   <p>
     HTML-ը նախատեսված է վեբ էջեր ստեղծելու համար և ունի նախապես սահմանված պիտակներ, մինչդեռ XML-ն օգտագործվում է կառուցվածքային տվյալներ պահելու և փոխանցելու համար և թույլ է տալիս սահմանել հատուկ թեգեր և ատրիբուտներ:
   </p>
{/* Как начать работать с XML */}

<h2>Ինչպես սկսել աշխատել XML-ի հետ</h2>

   <p>
     XML-ի հետ աշխատելու համար ձեզ հարկավոր է տեքստային խմբագրիչ և հիմնական շարահյուսության իմացություն:
     Դուք կարող եք սկսել՝ ծանոթանալով XML փաստաթղթերի կառուցվածքին, դրանց հիմնական տարրերին և ատրիբուտներին,
     և XML տվյալների մշակման մեթոդներ՝ օգտագործելով գրադարաններ կամ գործիքներ ձեր ծրագրավորման լեզվով:
   </p>

{/* Как начать работать с HTML */}

<h2>Ինչպես սկսել աշխատել HTML-ի հետ</h2>

  <p>
     HTML-ի հետ աշխատելու համար ձեզ անհրաժեշտ կլինի նաև տեքստային խմբագրիչ և նշագրման հիմունքների իմացություն:
     Դուք կարող եք սովորել հիմնական HTML թեգերը, դրանց հատկանիշները և վեբ էջի կառուցվածքը,
     և ոճավորման և ինտերակտիվության տեխնիկա՝ օգտագործելով CSS և JavaScript:
  </p>

    <b><p>* Տեքստը գրված է թարգմանչի օգնությամբ։ Եթե սխալ եք հայտնաբերել, խնդրում ենք մեզ տեղյակ պահել *</p></b>
    
    <div className='ads-container'>  
    {/*  реклама  */}
  </div>
    </div>
  )
}

export default AmHtml_7;