import React from 'react';

function AmTechTitans() {
  return (
    <div>
      <div className='ad-container'>  
        {/*  реклама  */}
      </div>

        <h1 className="heading">Ծրագրավորողներ, ովքեր փոխեցին աշխարհը</h1>  
            <ul className="programmers-list">
                <li className="programmer">
                    <strong>Լինուս Տորվալդս.&nbsp;&nbsp;</strong> ֆինն ծրագրավորող, ծնվել է 1969 թվականի դեկտեմբերի 28-ին Հելսինկիում: Նա դարձավ բաց կոդով ծրագրային ապահովման աշխարհի ամենանշանակալից և ազդեցիկ մշակողներից մեկը՝ շնորհիվ իր գլխավոր նվաճման՝ ստեղծելով Linux օպերացիոն համակարգի միջուկը:
                    
                    <p>Linux-ի պատմությունը սկսվել է 1991 թվականին, երբ Թորվալդսը, երբ ուսանող էր Հելսինկիի համալսարանում, սկսեց աշխատել իր օպերացիոն համակարգի նախագծի վրա: Նա ցանկանում էր անվճար այլընտրանք ստեղծել Unix-ի նման առևտրային համակարգերին, ինչպիսին է MINIX-ը: Մի քանի ամսվա ընթացքում նա ստեղծեց Linux միջուկի առաջին տարբերակը, որը նախատեսված էր անձնական օգտագործման համար:</p>
                   
                    <p>Ժամանակի ընթացքում Linux-ը հայտնի դարձավ տարբեր ոլորտներում, ներառյալ սերվերային և ներկառուցված համակարգերը, և դարձավ աշխարհում ամենաշատ օգտագործվող օպերացիոն համակարգերից մեկը: Բաց կոդով բնույթը և սկզբունքները, որոնց վրա հիմնված է Linux-ը, նպաստել են դրա աճին և զարգացմանը՝ աշխարհի հազարավոր ծրագրավորողների ներդրումների շնորհիվ:</p>
                   
                    <p>Torvalds-ը շարունակում է ակտիվորեն մասնակցել Linux միջուկի մշակմանը և պահպանմանը` պահպանելով ազատ և բաց կոդով ծրագրաշարի իր փիլիսոփայությունը: Նրա ներդրումը օպերացիոն համակարգերի և ծրագրավորման տեխնոլոգիաների զարգացման գործում չի կարելի չգնահատել:</p>
                </li>
                <li className="programmer">
                    <strong>Թիմ Բերներս-Լի.&nbsp;&nbsp;</strong> բրիտանացի համակարգչային գիտնական, ծնվել է 1955 թվականի հունիսի 8-ին Լոնդոնում: Նա դարձավ համաշխարհային սարդոստայնի գյուտարարը՝ դարձնելով նրան տեղեկատվական տեխնոլոգիաների պատմության ամենակարևոր և ազդեցիկ դեմքերից մեկը։
                    
                    <p>1989 թվականին Բերներս-Լին մշակեց և ներկայացրեց համացանցի առաջին հայեցակարգը, որն իր մեջ ներառում էր հիպերտեքստային փաստաթղթերի համակարգ, որոնք միմյանց կապակցված էին հիպերհղումներով: Նա ստեղծեց HTTP (Hypertext Transfer Protocol) և HTML (Hypertext Markup Language)՝ համացանցի հիմքում ընկած հիմնարար տեխնոլոգիաները:</p>
                   
                    <p>Վեբի ստեղծումից հետո Թիմ Բերներս-Լին շարունակեց ակտիվորեն մասնակցել վեբ ստանդարտների մշակմանը և ներգրավված էր Համաշխարհային ցանցի կոնսորցիումի (W3C) ստեղծման մեջ, որի նպատակն է զարգացնել և աջակցել միասնական համակարգին: Համաշխարհային սարդոստայնի ստանդարտներ:</p>
                   
                    <p>Տեղեկատվական տեխնոլոգիաների ոլորտում իր ձեռքբերումների համար Թիմ Բերներս-Լին արժանացել է բազմաթիվ մրցանակների և պարգևների, ներառյալ Բրիտանական կայսրության շքանշանը և հաշվողական տեխնիկայի Նոբելյան մրցանակը:</p>
                </li>
                <li className="programmer">
                <strong>Ալան Թյուրինգ.&nbsp;&nbsp;</strong> բրիտանացի մաթեմատիկոս և կրիպտոգրաֆ, ծնվել է 1912 թվականի հունիսի 23-ին Լոնդոնում: Նա դարձավ 20-րդ դարի մեծագույն ուղեղներից մեկը և հսկայական ներդրում ունեցավ համակարգիչների և ինֆորմատիկայի զարգացման գործում:
                    
                    <p>Ալան Թյուրինգի աշխատանքը մեծ ազդեցություն ունեցավ գիտության տարբեր ոլորտների վրա, ներառյալ տրամաբանությունը, համակարգչային գիտությունը, արհեստական բանականությունը և ծածկագրությունը: Նրա ամենահայտնի ներդրումը Թյուրինգ մեքենայի հայեցակարգի մշակումն է, որը հիմք դարձավ ժամանակակից համակարգիչների և ծրագրավորման համար:</p>
                   
                    <p>Երկրորդ համաշխարհային պատերազմի ժամանակ Ալան Թյուրինգը առանցքային դեր է խաղացել նացիստների կողմից օգտագործվող «Enigma» ծածկագրի վերծանման գործում: Նրա աշխատանքը գաղտնագրության և ծածկագրերի խախտման ոլորտում վճռորոշ ազդեցություն ունեցավ պատերազմի ելքի վրա:</p>
                   
                    <p>Պատերազմից հետո Թյուրինգը շարունակեց իր հետազոտությունները համակարգիչների և արհեստական ինտելեկտի ոլորտում։ Նա կարևոր ներդրում ունեցավ հաշվարկների տեսության մեջ և մշակեց արհեստական ինտելեկտի մասին վաղ գաղափարներ, ներառյալ «Թյուրինգի թեստը»՝ մեքենայի ինտելեկտուալ հնարավորությունները որոշելու համար:</p>
                   
                    <p>Գիտության ոլորտում իր ձեռքբերումների համար Ալան Թյուրինգը արժանացել է բազմաթիվ հեղինակավոր մրցանակների և պատվոգրերի, և նրա աշխատանքը շարունակում է ոգեշնչել և ազդել ժամանակակից տեխնոլոգիաների զարգացման վրա:</p>
                </li>
                <li className="programmer">
                    <strong>Գրեյս Հոփեր.&nbsp;&nbsp;</strong>ամերիկացի գիտնական և ծրագրավորող, ծնվել է 1906 թվականի դեկտեմբերի 9-ին Նյու Յորքում: Նա համակարգչային տեխնիկայի պատմության մեջ ամենակարևոր և ազդեցիկ դեմքերից էր, ինչպես նաև ծրագրավորման ոլորտում առաջամարտիկ:
                    
                    <p>Գրեյս Հոփերը հայտնի է համակարգչային լեզուների և կոմպիլյատորների զարգացման գործում իր նշանակալի ներդրումով: Նա մշակեց առաջին կոմպիլյատորը A-0 ծրագրավորման լեզվի համար, որը առաջին քայլն էր ավելի բարձր մակարդակի ծրագրավորման լեզուներ ստեղծելու ուղղությամբ:</p>
                   
                    <p>Կոմպիլյատորներում նրա աշխատանքը հանգեցրեց COBOL (Common Business-Oriented Language) ծրագրավորման լեզվի ստեղծմանը, որը դարձավ առևտրային հատվածում ամենաշատ օգտագործվող ծրագրավորման լեզուներից մեկը: COBOL-ը հսկայական ազդեցություն ունեցավ բանկային, հաշվապահական և այլ բիզնես ոլորտների զարգացման վրա:</p>
                   
                    <p>Ի լրումն ծրագրավորման իր աշխատանքին, Գրեյս Հոփերը նաև ռազմական սպա էր և մասնակցել է վաղ էլեկտրոնային համակարգիչների մշակմանը, ինչպիսիք են Հարվարդի Մարկ I-ը և UNIVAC-ը: Նրա ներդրումը տեղեկատվական տեխնոլոգիաների ոլորտում չի կարելի գերագնահատել, և նա ոգեշնչում է գիտության և տեխնոլոգիայի ոլորտներում շատ կանանց համար:</p>
                </li> 
            <li className="programmer">
                 <strong>Ադա Լավլեյս.&nbsp;&nbsp;</strong> բրիտանացի մաթեմատիկոս և համակարգչային գիտության ռահվիրա, ծնվել է 1815 թվականի դեկտեմբերի 10-ին Լոնդոնում: Նա հաճախ համարվում է պատմության առաջին ծրագրավորողը՝ վերլուծական շարժիչի վրա իր աշխատանքի և խորհրդանիշների, այլ ոչ միայն թվերի մշակման համար մեքենա օգտագործելու գաղափարի շնորհիվ:
                 
                 <p>Ադա Լավլեյսը հայտնի դարձավ Չարլզ Բեբիջի հետ իր աշխատանքով մեխանիկական համակարգչի վրա, որը հայտնի է որպես վերլուծական շարժիչ: Վերլուծական շարժիչի մասին հոդվածի իր նշումներում նա գրել է Բեռնուլիի թվերի հաշվարկման ալգորիթմ, որը համարվում է առաջին ծրագրային կոդը, որը նախատեսված է մեքենայի վրա աշխատելու համար:</p>
                 
                 <p>Չնայած վերլուծական շարժիչը երբեք ամբողջությամբ չի կառուցվել, Ադա Լավլեյսի աշխատանքը ելակետ դարձավ ծրագրավորման և համակարգչային գիտության զարգացման համար: Համակարգիչների հնարավորությունների մասին նրա տեսլականը գերազանցեց իր ժամանակին և հսկայական ազդեցություն ունեցավ տեխնոլոգիայի ապագա զարգացման վրա:</p>
                 
                 <p>Ադա Լավլեյսը մահացել է 36 տարեկանում, սակայն նրա ներդրումը համակարգչային գիտության և ծրագրավորման ոլորտում շարունակում է ոգեշնչել և հուզել աշխարհի գիտնականների և ինժեներների մտքերը:</p>
            </li>
        <li className="programmer">
          <strong>Բիլ Գեյթս.&nbsp;&nbsp;</strong> ամերիկացի ձեռնարկատեր, ծրագրավորող և բարերար, ծնվել է 1955 թվականի հոկտեմբերի 28-ին Վաշինգտոնի Սիեթլ քաղաքում: Նա հայտնի դարձավ որպես Microsoft-ի համահիմնադիր և անհատական համակարգիչների և ծրագրային ապահովման մշակման առանցքային դեմքերից մեկը։
          
          <p>Բիլ Գեյթսը հիմնադրել է Microsoft-ը 1975 թվականին Փոլ Ալենի հետ: Նրանց նպատակն էր ստեղծել օպերացիոն համակարգ անհատական համակարգիչների համար։ Նրանք մշակեցին և թողարկեցին MS-DOS-ը, որը հետագայում դարձավ ամենահայտնի օպերացիոն համակարգերից մեկը IBM PC-ի և նրա համատեղելի համակարգիչների համար:</p>
          
          <p>Համակարգչային արդյունաբերության զարգացմանը զուգընթաց Microsoft-ը շարունակում էր առաջատար դիրքեր զբաղեցնել՝ թողարկելով օպերացիոն համակարգերի նոր տարբերակներ, ինչպիսիք են Windows-ը և ծրագրային ապահովումը, ինչպիսին է գրասենյակային հավելվածները: Գեյթսի ջանքերի շնորհիվ ընկերությունը դարձավ աշխարհում ամենահաջողակ և ազդեցիկներից մեկը:</p>
         
          <p>Մայքրոսոֆթում իր աշխատանքից բացի, Բիլ Գեյթսը հայտնի է Բիլ և Մելինդա Գեյթս հիմնադրամի միջոցով բարեգործությամբ: Նա զգալի ռեսուրսներ է ներդրել կրթության, առողջապահության և աղքատության հաղթահարման ոլորտում և շարունակում է ակտիվորեն մասնակցել տարբեր սոցիալական նախագծերին:</p>
        
        <p>Բիլ Գեյթսը մնում է տեղեկատվական տեխնոլոգիաների աշխարհի ամենաազդեցիկ և ճանաչված առաջնորդներից մեկը, և նրա ներդրումը համակարգչային արդյունաբերության զարգացման մեջ չի կարելի չգնահատել:</p>
      </li>

<li className="programmer">
   <strong>Սթիվ Վոզնյակ.&nbsp;&nbsp;</strong>ամերիկացի ինժեներ, ծրագրավորող և ձեռնարկատեր, ծնվել է 1950 թվականի օգոստոսի 11-ին Սան Խոսեում, Կալիֆորնիա: Նա հայտնի դարձավ որպես Apple-ի համահիմնադիր և ընկերության առաջին համակարգիչների մշակողը։
   
   <p>Սթիվ Վոզնյակը, որը հաճախ կոչվում է «Վոզ», առանցքային դեր է խաղացել Apple-ի վաղ պատմության մեջ: Սթիվ Ջոբսի հետ նա մշակեց և թողարկեց առաջին անհատական համակարգիչներից մեկը՝ Apple I-ը, որը նշանավորեց ընկերության լեգենդար պատմության սկիզբը:</p>
   
   <p>Հետագայում Վոզնյակը ստեղծեց ավելի հաջող և հայտնի համակարգիչ՝ Apple II-ը, որը դարձավ առաջին անհատական համակարգիչներից մեկը՝ գունավոր էկրանով և ներկառուցված հիմնական ծրագրավորման լեզվով: Apple II-ը ընկերությանը մեծ հաջողություն բերեց և օգնեց հաստատել իր դիրքերը շուկայում:</p>
   
   <p>Սթիվ Վոզնյակը Apple-ում իր աշխատանքին զուգահեռ շարունակեց ակտիվորեն մասնակցել տեղեկատվական տեխնոլոգիաների ոլորտում տարբեր նախագծերի։ Նա կրթության և տեխնիկական նորարարությունների կողմնակից է և շարունակում է ոգեշնչել շատերին իր գաղափարներով և ձեռքբերումներով:</p>
   
   <p>Սթիվ Վոզնյակը մնում է համակարգչային արդյունաբերության ամենահարգված և ճանաչված առաջնորդներից մեկը, և նրա ներդրումը համակարգչային տեխնոլոգիաների զարգացման գործում չի կարելի չգնահատել:</p>
</li>

<li className="programmer">
   <strong>Դենիս Ռիչի.&nbsp;&nbsp;</strong>ամերիկացի համակարգչային գիտնական, ծնվել է 1941 թվականի սեպտեմբերի 9-ին Բրոնքսում, Նյու Յորք: Նա հայտնի դարձավ որպես C ծրագրավորման լեզվի ստեղծող և UNIX օպերացիոն համակարգի մշակման մասնակից՝ դարձնելով նրան համակարգչային գիտության պատմության ամենաազդեցիկ դեմքերից մեկը։
   
   <p>Դենիս Ռիչին համարվում է ծրագրավորման լեզուների զարգացման առանցքային դեմքերից մեկը։ 1972 թվականին նա Քեն Թոմփսոնի հետ մշակեց C լեզուն՝ որպես Bell Labs-ում UNIX օպերացիոն համակարգի զարգացման նախագծի մաս:</p>
   
   <p>C լեզուն դարձավ պատմության մեջ ամենաազդեցիկ ծրագրավորման լեզուներից մեկը և հսկայական ազդեցություն ունեցավ համակարգչային արդյունաբերության զարգացման վրա: Այն հիմք հանդիսացավ ծրագրավորման շատ այլ լեզուների համար և ծրագրավորողների սերունդներին սովորեցրեց համակարգչային ծրագրավորման հիմունքները:</p>
   
   <p>Ի լրումն C լեզվի իր աշխատանքին, Դենիս Ռիչին նաև մասնակցեց UNIX օպերացիոն համակարգի մշակմանը, որը դարձավ համակարգչային պատմության մեջ ամենահայտնի և ազդեցիկ օպերացիոն համակարգերից մեկը:</p>
   
   <p>Դենիս Ռիչիի ներդրումը համակարգչային գիտության և տեխնոլոգիայի զարգացման մեջ չի կարելի չգնահատել: Նրա աշխատանքը հսկայական ազդեցություն ունեցավ համակարգչային արդյունաբերության տարբեր ասպեկտների վրա և շարունակում է ոգեշնչել ծրագրավորողներին և ինժեներներին ամբողջ աշխարհում:</p>
</li>

<li className="programmer">
   <strong>Քեն Թոմփսոն.&nbsp;&nbsp;</strong>ամերիկացի ծրագրավորող և ինժեներ, ծնվել է 1943 թվականի հոկտեմբերի 4-ին Նյու Օռլեանում, Լուիզիանա: Նա հայտնի դարձավ որպես B ծրագրավորման լեզվի համահեղինակ և համակարգչային գիտության պատմության մեջ կարևորագույն լեզուներից երկուսի՝ Go ծրագրավորման լեզվի ստեղծող։
   
   <p>1969 թվականին Քեն Թոմփսոնը, աշխատելով Bell Labs-ում, Դենիս Ռիչիի հետ միասին մշակեց B ծրագրավորման լեզուն, որը C լեզվի նախորդն էր։ B լեզուն հիմք դարձավ UNIX-ի զարգացման համար և դարձավ կարևոր գործիք օպերացիոն համակարգերի և կիրառական ծրագրերի մշակման համար:</p>
   
   <p>Հետագայում Քեն Թոմփսոնը Ռոբ Փայքի և Ռոբերտ Գրիզեմերի հետ միասին մշակեցին Go ծրագրավորման լեզուն, որը ներկայացվեց 2009 թվականին: Go-ն ստեղծվել է ծրագրավորման արդյունավետություն և պարզություն ապահովելու, ինչպես նաև որոշ խնդիրներ լուծելու համար, որոնց բախվել են ծրագրավորողները, երբ օգտագործելով այլ լեզուներ:</p>
   
   <p>Go լեզուն արագորեն հայտնի դարձավ մշակողների շրջանում՝ շնորհիվ իր պարզության, հուսալիության և արդյունավետության: Այն լայն կիրառություն գտավ տարբեր ոլորտներում, ներառյալ վեբ հավելվածները, ամպային ծառայությունները և համակարգի ծրագրավորումը:</p>
   
   <p>Քեն Թոմփսոնը շարունակում է ակտիվորեն մասնակցել Go լեզվի մշակմանը և աջակցմանը, և նրա ներդրումը ծրագրավորման և տեղեկատվական տեխնոլոգիաների զարգացման գործում մնում է աներևակայելի նշանակալի:</p>
</li>

<li className="programmer">
   <strong>Մարգարեթ Համիլթոն.&nbsp;&nbsp;</strong>ամերիկացի գիտնական և ծրագրավորող, ծնվել է 1936 թվականի օգոստոսի 17-ին Փենսիլվանիայում: Նա հայտնի դարձավ որպես ծրագրավորողների խմբի ղեկավար, ովքեր ծրագրային ապահովում էին մշակել Apollo ծրագրի համար և առանցքային դեր խաղաց ՆԱՍԱ-ի Apollo առաքելությունների հաջող իրականացման գործում:
   
   <p>Մարգարեթ Համիլթոնը միացավ MIT-ի գործիքավորման լաբորատորիան 1960-ականների սկզբին, որտեղ նա աշխատում էր տիեզերանավերի առաքելությունների համար ծրագրային ապահովման մշակման վրա: Նա ղեկավարել է ծրագրավորողների մի խումբ, ովքեր մշակել են համակարգային ծրագրակազմը Apollo տիեզերանավի համար, ներառյալ թռիչքը և վայրէջքը վերահսկող ծրագրակազմը:</p>
   
   <p>Նրա աշխատանքը վճռորոշ նշանակություն ունեցավ Apollo առաքելությունների հաջողության համար: Մասնավորապես, «Ապոլոն 11» առաքելության ժամանակ անսպասելի խնդիրներ են առաջացել լուսնային վայրէջքի ժամանակ։ Մարգարեթ Համիլթոնի և նրա խմբի կողմից մշակված ծրագրաշարի ճկունության և հուսալիության շնորհիվ անձնակազմը կարողացավ հաջողությամբ ավարտել վայրէջքը և վերադառնալ Երկիր:</p>
   
   <p>NASA-ում աշխատելուց հետո Մարգարեթ Համիլթոնը շարունակեց իր կարիերան ծրագրավորման և տեղեկատվական տեխնոլոգիաների ոլորտում: Նա դարձավ ծրագրային ապահովման ճարտարագիտության ոլորտում առաջամարտիկ և շարունակում է ոգեշնչել շատ ծրագրավորողների և ինժեներների համար:</p>
</li>

<li className="programmer">
   <strong>Ջոն Մաքքարթի.&nbsp;&nbsp;</strong>ամերիկացի գիտնական և ծրագրավորող, ծնվել է 1927 թվականի սեպտեմբերի 4-ին Բոստոնում, Մասաչուսեթս: Նա հայտնի դարձավ որպես Lisp ծրագրավորման լեզվի ստեղծող և արհեստական ինտելեկտի առաջամարտիկներից մեկը։
   
   <p>Ջոն Մաքքարթին համակարգչային գիտության պատմության մեծագույն ուղեղներից մեկն է: 1958 թվականին նա ստեղծել է Lisp (List Processing) ծրագրավորման լեզուն, որը դարձել է առաջին և ամենաազդեցիկ ֆունկցիոնալ ծրագրավորման լեզուներից մեկը։ Lisp-ն օգտագործվել է տարբեր ոլորտներում, ներառյալ արհեստական բանականության հետազոտությունները:</p>
   
   <p>Ջոն Մաքքարթին նույնպես առանցքային դեր է խաղացել արհեստական ինտելեկտի զարգացման գործում: Նա հորինեց «արհեստական ինտելեկտ» տերմինը և մշակեց բազմաթիվ տեսական և գործնական գաղափարներ, որոնք դրեցին այս գիտության հիմքը։ Նրա աշխատանքը տրամաբանության և գիտելիքների ֆորմալիզացման ոլորտում հսկայական ազդեցություն ունեցավ արհեստական ինտելեկտի հետագա զարգացման վրա:</p>
   
   <p>Իր կարիերայի ընթացքում Ջոն Մաքքարթին բազմաթիվ մրցանակների և ճանաչման է արժանացել իր գիտական նվաճումների համար: Նրա ներդրումը համակարգչային գիտության և արհեստական ինտելեկտի զարգացման գործում մնում է աներևակայելի նշանակալի և շարունակում է ոգեշնչել գիտնականներին և ինժեներներին ամբողջ աշխարհում:</p>
</li>

<li className="programmer">
   <strong>Բյորն Ստրաուստրուպ.&nbsp;&nbsp;</strong> դանիացի գիտնական և ծրագրավորող, ծնվել է 1950 թվականի դեկտեմբերի 30-ին Դանիայի Օրհուս քաղաքում: Նա հայտնի դարձավ որպես C++ ծրագրավորման լեզվի ստեղծող՝ ամենաազդեցիկ և լայնորեն օգտագործվող ծրագրավորման լեզուներից մեկը։
   
   <p>Բյորն Ստրաուստրուպ-ը մշակել է C++ ծրագրավորման լեզուն 1980-ականների սկզբին ԱՄՆ-ի Bell Labs-ում: Այն մշակվել է որպես C ծրագրավորման լեզվի ընդլայնում` նպատակ ունենալով ավելացնել օբյեկտի վրա հիմնված ծրագրավորման հնարավորությունները և բարձրացնել ծրագրային ապահովման մշակման արդյունավետությունն ու ճկունությունը:</p>
   
   <p>C++ լեզուն լայն տարածում գտավ և կիրառվեց բազմաթիվ ոլորտներում, ներառյալ համակարգի ծրագրավորումը, հավելվածների մշակումը, խաղերը, բջջային հավելվածները և շատ այլ ոլորտներ: Այն դարձավ ամենահայտնի և պահանջված ծրագրավորման լեզուներից մեկը՝ շնորհիվ իր արդյունավետության, ճկունության և հզորության:</p>
   
   <p>Բյորն Ստրաուստրուպ-ը շարունակում է ակտիվորեն մասնակցել C++-ի մշակմանը և հանդիսանում է մշակողների համայնքի առանցքային դեմքերից մեկը: Նրա աշխատանքները և գաղափարները շարունակում են ազդել ծրագրավորման և համակարգչային գիտության զարգացման վրա:</p>
</li>

<li className="programmer">
   <strong>Գվիդո վան Ռոսում.&nbsp;&nbsp;</strong> հոլանդացի ծրագրավորող, ծնվել է 1956թ. հունվարի 31-ին Հաագայում, Նիդեռլանդներ: Նա հայտնի դարձավ որպես Python ծրագրավորման լեզվի ստեղծող՝ աշխարհում ամենահայտնի և լայնորեն օգտագործվող ծրագրավորման լեզուներից մեկը։
   
   <p>Գվիդո վան Ռոսումը սկսեց աշխատել Python-ի զարգացման վրա 1980-ականների վերջին, և լեզվի առաջին տարբերակը թողարկվեց 1991 թվականին: Python-ը ստեղծվել է պարզ, բայց հզոր ծրագրավորման լեզու տրամադրելու նպատակով, որը կարող է ապահովել արդյունավետություն և հարմարավետություն: ծրագրային ապահովման մշակման մեջ:</p>
   
   <p>Python-ը դարձավ լայնորեն օգտագործվող ծրագրավորման լեզու տարբեր ոլորտներում, ներառյալ վեբ մշակումը, գիտական հաշվարկները, արհեստական ինտելեկտը, տվյալների վերլուծությունը, ավտոմատացումը և շատ այլ ոլորտներ: Այն առանձնանում է իր պարզ և հասկանալի շարահյուսությամբ՝ դարձնելով այն շատ հասանելի սկսնակ ծրագրավորողների համար, մինչդեռ հզոր փորձառու ծրագրավորողների համար:</p>
   
   <p>Գվիդո վան Ռոսում-ը շարունակում է ակտիվորեն մասնակցել Python-ի զարգացմանը և մնում է դրա հիմնական մշակողներից մեկը: Նրա ներդրումը ծրագրավորման և տեղեկատվական տեխնոլոգիաների մեջ չի կարելի չգնահատել, և նրա աշխատանքը շարունակում է ոգեշնչել բազմաթիվ մշակողների ամբողջ աշխարհում:</p>
</li>

<li className="programmer">
   <strong>Լարի Փեյջ և Սերգեյ Բրին.&nbsp;&nbsp;</strong>ամերիկացի ձեռներեցներ և ծրագրավորողներ, ծնված համապատասխանաբար 1973 թվականի մարտի 26-ին (Լարի Փեյջ) և 1973 թվականի օգոստոսի 21-ին (Սերգեյ Բրին): Նրանք հայտնի դարձան որպես Google-ի համահիմնադիրներ՝ աշխարհի ամենամեծ և ամենաազդեցիկ ընկերություններից մեկը, որի նորարարությունները որոնման համակարգերում և ինտերնետ տեխնոլոգիաներում փոխել են ամբողջ աշխարհում տեղեկատվության հասանելիությունը:
   
   <p>Լարի Փեյջը և Սերգեյ Բրինը ծանոթացել են Սթենֆորդի համալսարանում, որտեղ երկուսն էլ համակարգչային գիտություն էին սովորում: Ավելի արդյունավետ որոնման համակարգ ստեղծելու նրանց համատեղ նախագիծը հանգեցրեց Google-ի ստեղծմանը 1998 թվականին: Նրանք մշակեցին որոնման ալգորիթմ, որը դասակարգում էր վեբ էջերը՝ հիմնվելով դրանց նշանակության վրա, ինչը հանգեցնում է որոնման արդյունքների որակի բարելավմանը:</p>
   
   <p>Google-ը դարձավ պատմության մեջ ամենահաջողակ ինտերնետային նախագծերից մեկը՝ շնորհիվ տեղեկատվության որոնման իր նորարարական մոտեցման և մի շարք առցանց ծառայությունների մատուցման, ինչպիսիք են Gmail-ը, Google Maps-ը, YouTube-ը և շատ ուրիշներ:</p>
   
   <p>Լարի Փեյջը և Սերգեյ Բրինը շարունակում են ակտիվորեն մասնակցել Google-ի և տեղեկատվական տեխնոլոգիաների հետ կապված այլ նախագծերի զարգացմանը: Նրանց ներդրումը ժամանակակից ինտերնետ արդյունաբերության մեջ անգնահատելի է, և նրանք շարունակում են մնալ կարևոր դեմքեր ձեռներեցության և տեխնոլոգիաների աշխարհում:</p>
</li>

<li className="programmer">
   <strong>Անդերս Հեյլսբերգ.&nbsp;&nbsp;</strong> դանիացի ծրագրավորող, ծնվել է 1960 թվականի դեկտեմբերի 2-ին Կոպենհագենում, Դանիա: Նա հայտնի դարձավ որպես C# ծրագրավորման լեզվի գլխավոր ճարտարապետ և TypeScript-ի մշակող՝ ժամանակակից տեղեկատվական տեխնոլոգիաների աշխարհում ծրագրավորման երկու կարևոր լեզուներից։
   
   <p>Անդերս Հեյլսբերգը ներգրավված էր ծրագրավորման մի քանի հիմնական լեզուների մշակման մեջ: 1983թ.-ին նա միացավ Borland-ին, որտեղ նա մշակեց Turbo Pascal-ը՝ Պասկալ լեզվի զարգացման առաջին ինտեգրված միջավայրերից մեկը: Turbo Pascal-ը լայն տարածում գտավ և զգալի ազդեցություն ունեցավ ծրագրավորման զարգացման վրա 1980-ականներին:</p>
   
   <p>1996 թվականին Անդերս Հեյլսբերգը միացավ Microsoft-ին, որտեղ նա դարձավ C# ծրագրավորման լեզվի գլխավոր ճարտարապետը: C#-ը մշակվել է որպես օբյեկտի վրա հիմնված ծրագրավորման լեզու, որն ուղղված է .NET հարթակին և արագորեն դարձել է աշխարհի ամենահայտնի ծրագրավորման լեզուներից մեկը:</p>
   
   <p>Բացի C#-ի վրա աշխատելուց, Անդերս Հեյլսբերգը նաև TypeScript-ի մշակողն է՝ ծրագրավորման լեզու, որն ընդլայնում է JavaScript-ի հնարավորությունները՝ ավելացնելով ստատիկ մուտքագրում և այլ հնարավորություններ՝ մեծ և բարդ հավելվածներ մշակելու համար:</p>
   
   <p>Անդերս Հեյլսբերգի ներդրումը ծրագրավորման լեզուների և տեղեկատվական տեխնոլոգիաների զարգացման գործում հսկայական է, և նրա աշխատանքը շարունակում է ոգեշնչել բազմաթիվ մշակողների ամբողջ աշխարհում:</p>
</li>

<li className="programmer">
   <strong>Բրենդան Էյխ.&nbsp;&nbsp;</strong>կանադացի ծրագրավորող, ծնվել է 1961 թվականի հուլիսի 27-ին Վանկուվերում, Կանադա: Նա հայտնի դարձավ որպես JavaScript ծրագրավորման լեզվի ստեղծող՝ աշխարհում ամենալայն կիրառվող ծրագրավորման լեզուներից մեկը, որը դարձավ վեբ զարգացման և վեբ էջերում դինամիկ փոխազդեցության հիմնական բաղադրիչ:
   
   <p>Բրենդան Էյխը սկսեց աշխատել JavaScript-ի վրա 1995 թվականին, երբ նրան վարձեցին Netscape Communications-ը Netscape Navigator բրաուզերի համար ծրագրավորման լեզու ստեղծելու համար: Նա մշակեց JavaScript-ը 10 օրվա ընթացքում, և լեզուն առաջին անգամ ներդրվեց Netscape Navigator 4.0-ում 1996 թվականին:</p>
   
   <p>JavaScript-ը ստեղծվել է վեբ էջերին ինտերակտիվություն և դինամիկ բովանդակություն ավելացնելու համար՝ թույլ տալով ծրագրավորողներին ստեղծել ավելի դինամիկ և ֆունկցիոնալ վեբ հավելվածներ: Տարիների ընթացքում JavaScript-ը դարձել է համացանցի ծրագրավորման առաջնային լեզուներից մեկը և վեբ տեխնոլոգիաների զարգացման առաջատար դիրքում է:</p>
   
   <p>Բրենդան Էյխը շարունակում է ակտիվորեն մասնակցել JavaScript-ի մշակմանը և ստանդարտացմանը, և նրա աշխատանքը այս ոլորտում մնում է աներևակայելի նշանակալի վեբ զարգացման և տեղեկատվական տեխնոլոգիաների աշխարհի համար:</p>
</li>

<li className="programmer">
   <strong>Ջեյմս Գոսլինգ.&nbsp;&nbsp;</strong>կանադացի ծրագրավորող և գիտնական, ծնվել է 1955 թվականի մայիսի 19-ին Կանադայի Կալգարի քաղաքում: Նա հայտնի դարձավ որպես Java ծրագրավորման լեզվի ստեղծող՝ աշխարհում ամենահայտնի և լայնորեն օգտագործվող ծրագրավորման լեզուներից մեկը, որը հիմք դարձավ տարբեր տեսակի ծրագրային ապահովման մշակման համար:
   
   <p>Ջեյմս Գոսլինգը Java լեզվի վրա սկսեց աշխատել 1990-ականների կեսերին Sun Microsystems-ում, երբ ընկերությունը փնտրում էր ներկառուցված համակարգերի ծրագրավորումը բարելավելու ուղիներ: Java-ն մշակվել է՝ հաշվի առնելով շարժականության, կատարողականի և անվտանգության պահանջները, և արագորեն հայտնի դարձավ վեբ հավելվածների, բջջային հավելվածների, խոշոր կորպորատիվ համակարգերի և շատ այլ ոլորտների մշակման համար:</p>
   
   <p>Java-ն ներկայացվել է 1995 թվականին և արագորեն ժողովրդականություն է ձեռք բերել իր պարզության, հուսալիության և հզորության շնորհիվ: Այն դարձավ կորպորատիվ միջավայրի հիմնական ծրագրավորման լեզուներից մեկը և լայնորեն օգտագործվում է տարբեր ոլորտներում, այդ թվում՝ ֆինանսների, հեռահաղորդակցության, առողջապահության և այլ ոլորտներում:</p>
   
   <p>Ջեյմս Գոսլինգը շարունակում է ակտիվորեն մասնակցել Java-ի զարգացմանը և հանդիսանում է ծրագրավորման և տեղեկատվական տեխնոլոգիաների ոլորտում առաջատար մասնագետներից մեկը։ Նրա աշխատանքը Java-ի վրա հսկայական ազդեցություն է ունեցել համակարգչային արդյունաբերության զարգացման վրա և հետք է թողել ծրագրային ապահովման մշակման աշխարհում:</p>
</li>

<li className="programmer">
   <strong>Մարկ Ցուկերբերգ.&nbsp;&nbsp;</strong>ամերիկացի ծրագրավորող և ձեռնարկատեր, ծնվել է 1984 թվականի մայիսի 14-ին Նյու Յորքի Ուայթ Փլեյնս քաղաքում: Նա հայտնի դարձավ որպես Facebook-ի հիմնադիր և գործադիր տնօրեն՝ աշխարհի ամենամեծ և ամենաազդեցիկ սոցիալական ցանցերից մեկը։
   
   <p>Մարկ Ցուկերբերգը սկսել է ծրագրավորել վաղ տարիքից, իսկ Հարվարդի համալսարանում աշխատելու ընթացքում նա մշակել է սոցիալական ցանցի նախատիպը, որը հետագայում վերածվել է Facebook-ի: Facebook-ը հիմնադրվել է 2004 թվականին և արագորեն մեծ ճանաչում ձեռք բերեց համալսարանի ուսանողների, այնուհետև լայն հանրության շրջանում:</p>
   
   <p>Ցուկերբերգի ղեկավարությամբ Facebook-ը քոլեջի պարզ գաղափարից վերածվեց միջազգային սոցիալական մեդիայի հսկայի, որն ունի միլիարդավոր օգտատերեր ամբողջ աշխարհում: Նա առանցքային դեր է խաղացել պլատֆորմի զարգացման գործում՝ ներկայացնելով նոր հնարավորություններ և ընդլայնելով ընկերության բիզնեսը տարբեր շուկաներում և ոլորտներում:</p>
   
   <p>Բացի այդ, Մարկ Ցուկերբերգն ակտիվորեն ներգրավված է տարբեր հասարակական նախաձեռնություններում և բարեգործական նախագծերում, այդ թվում՝ կրթության և բժշկության ոլորտներում: Նրա ազդեցությունը տեղեկատվական տեխնոլոգիաների և սոցիալական փոխգործակցության աշխարհի վրա դժվար է չգնահատել, և նա շարունակում է մնալ աշխարհի ամենահայտնի և ազդեցիկ ձեռներեցներից մեկը:</p>
</li>

<p>Այս հավաքածուում մենք ուսումնասիրել ենք նշանավոր ծրագրավորողների ուշագրավ ներդրումը, ովքեր ձևավորել են տեխնոլոգիայի և տեղեկատվական գիտության աշխարհը: Հեղափոխական ծրագրավորման լեզուների ստեղծումից մինչև խաղերը փոխող ծրագրերի և համակարգերի մշակում, այս անհատները անջնջելի հետք են թողել համակարգչային գիտության լանդշաֆտի վրա և շարունակում են ոգեշնչել ծրագրավորողների և ինժեներների սերունդներին ամբողջ աշխարհում: Նրանց տեսլական աշխատանքն ու նվիրվածությունը ճանապարհ են հարթել թվային դարաշրջանում անթիվ նորարարությունների և առաջընթացների համար՝ ամրացնելով նրանց ժառանգությունը որպես տեղեկատվական տեխնոլոգիաների ոլորտում առաջամարտիկների:</p>

</ul>

<b><p>* Տեքստը գրված է թարգմանչի օգնությամբ։ Եթե սխալ եք հայտնաբերել, խնդրում ենք մեզ տեղյակ պահել *</p></b>
    
    <div className='ads-container'>  
  {/*  реклама  */}
  </div>
    </div>
  )
}

export default AmTechTitans;