import React from 'react';

function ArReact_10() {
  return (
    <div>
       <div className='ad-container'>  
          {/*  реклама  */}
        </div>
        
      <h2>أخطاء HTTP</h2>
           {/* الاستجابات التحذيرية (100 – 199) */}
      
           <h3>الاستجابات التحذيرية (100 – 199)</h3>
       <p>
         <strong>100 Continue:</strong> استقبل الخادم رؤوس الطلب ويجب على العميل المتابعة لإرسال جسم الطلب (في حالة الطلب الذي يحتاج إلى إرسال جسم؛ على سبيل المثال، طلب POST).
       </p>
       <p>
         <strong>101 Switching Protocols:</strong> طلب العميل من الخادم تبديل البروتوكولات ووافق الخادم على القيام بذلك.
       </p>
       <p>
         <strong>102 Processing:</strong> استقبل الخادم الطلب ويقوم بمعالجته، ولكن لا يتوفر رد حتى الآن.
       </p>
       <p>
         <strong>103 Early Hints:</strong> يشير إلى العميل أن الخادم من المرجح أن يرسل استجابة نهائية مع حقول الرأس المضمنة في الاستجابة التحذيرية.
       </p>
      

     {/* الاستجابات الناجحة (200 – 299) */}
      
       <h3>الاستجابات الناجحة (200 – 299)</h3>
       <p>
         <strong>200 OK:</strong> نجح الطلب. المعلومات المرجعية مع الاستجابة تعتمد على الأسلوب المستخدم في الطلب.
       </p>
       <p>
         <strong>201 Created:</strong> تم تحقيق الطلب، مما أدى إلى إنشاء مورد جديد.
       </p>
       <p>
         <strong>202 Accepted:</strong> تم قبول الطلب للمعالجة، ولكن لم يتم الانتهاء من المعالجة بعد.
       </p>
       <p>
         <strong>203 Non-Authoritative Information:</strong> قام الخادم بمعالجة الطلب بنجاح، ولكنه يعيد معلومات قد تكون من مصدر آخر.
       </p>
       <p>
         <strong>204 No Content:</strong> قام الخادم بمعالجة الطلب بنجاح ولا يعيد أي محتوى.
       </p>
       <p>
         <strong>205 Reset Content:</strong> قام الخادم بمعالجة الطلب بنجاح، ولكنه لا يعيد أي محتوى. يجب على العميل إعادة تعيين عرض المستند.
       </p>
       <p>
         <strong>206 Partial Content:</strong> الخادم يقوم بتسليم جزء فقط من المورد بسبب رأس النطاق المرسلة من قبل العميل.
       </p>
       <p>
         <strong>207 Multi-Status:</strong> تنقل استجابة متعددة الحالة معلومات حول موارد متعددة في حالات يمكن أن تكون فيها مجموعة متعددة من رموز الحالة مناسبة.
       </p>
      

     {/* رسائل التوجيه (300 – 399) */}
     
       <h3>رسائل التوجيه (300 – 399)</h3>
       <p>
         <strong>300 Multiple Choices:</strong> المورد المطلوب لديه خيارات متعددة، كل منها لها سمات واستجابات مختلفة.
       </p>
       <p>
         <strong>301 Moved Permanently:</strong> تم نقل المورد المطلوب بشكل دائم إلى عنوان URL جديد، ويجب أن تستخدم المراجع المستقبلية لهذا المورد أحد عناوين URL المرجعة.
       </p>
       <p>
         <strong>302 Found:</strong> المورد المطلوب يتواجد مؤقتًا تحت URI مختلف.
       </p>
       <p>
         <strong>303 See Other:</strong> يمكن العثور على الاستجابة للطلب تحت URI مختلف ويجب استرجاعه باستخدام طريقة GET على هذا المورد.
       </p>
       <p>
         <strong>304 Not Modified:</strong> يشير إلى أن المورد لم يتم تعديله منذ الإصدار المحدد من خلال رؤوس الطلب إذا كان If-Modified-Since أو If-None-Match. في مثل هذه الحالة، ليس هناك حاجة لإعادة إرسال المورد لأن العميل لا يزال لديه نسخة تم تنزيلها مسبقًا.
       </p>
       <p>
         <strong>305 Use Proxy:</strong> يجب الوصول إلى المورد المطلوب من خلال الوكيل الذي تم تحديده في حقل الموقع.
       </p>
       <p>
         <strong>307 Temporary Redirect:</strong> المورد المطلوب موجود مؤقتًا تحت URI مختلف.
       </p>
       <p>
         <strong>308 Permanent Redirect:</strong> تم نقل المورد المطلوب بشكل دائم إلى عنوان URL آخر، ويجب على العميل تحديث جميع المراجع لهذا العنوان الجديد.
       </p>
      

     {/* استجابات أخطاء العميل (400 – 499) */}
      
       <h3>استجابات أخطاء العميل (400 – 499)</h3>
       <p>
         <strong>400 Bad Request:</strong> الخادم لا يمكنه معالجة الطلب بسبب خطأ في العميل (على سبيل المثال، بناء الجملة المشوه، الحجم كبير جدًا، ترميز طلب غير صالح، أو توجيه طلب مضلل).
       </p>
       <p>
         <strong>401 Unauthorized:</strong> مشابه لـ 403 ممنوع، ولكن بشكل خاص للاستخدام عندما يكون التوثيق مطلوبًا وقد فشل أو لم يتم تقديمه بعد.
       </p>
       <p>
         <strong>402 Payment Required:</strong> محجوز للاستخدام المستقبلي.
       </p>
       <p>
         <strong>403 Forbidden:</strong> العميل ليس لديه إذن للوصول إلى المورد المطلوب.
       </p>
       <p>
         <strong>404 Not Found:</strong> الخادم لا يمكنه العثور على المورد المطلوب.
       </p>
       <p>
         <strong>405 Method Not Allowed:</strong> الطريقة المستلمة في سطر الطلب معروفة من قبل الخادم الأصلي ولكن لا يتم دعمها بواسطة المورد المستهدف.
       </p>
       <p>
         <strong>406 Not Acceptable:</strong> المورد المستهدف لا يحتوي على تمثيل حالي يمكن أن يكون مقبولًا لوكيل المستخدم، وفقًا لحقول رأس التفاوض النشطة المتلقاة في الطلب.
       </p>
       <p>
         <strong>407 Proxy Authentication Required:</strong> يجب على العميل المصادقة أولاً مع الوكيل.
       </p>
       <p>
         <strong>408 Request Timeout:</strong> لم يقم العميل بإنتاج طلب داخل الوقت الذي كان الخادم مستعدًا للانتظار.
       </p>
       <p>
         <strong>409 Conflict:</strong> لا يمكن إكمال الطلب بسبب صراع مع الحالة الحالية للمورد المستهدف.
       </p>
       <p>
         <strong>410 Gone:</strong> يشير إلى أن المورد المستهدف لم يعد متوفرًا على الخادم ولا يوجد عنوان توجيه معروف.
       </p>
       <p>
         <strong>411 Length Required:</strong> يرفض الخادم قبول الطلب بدون Content-Length معرف.
       </p>
       <p>
         <strong>412 Precondition Failed:</strong> فشلت واحدة أو أكثر من الشروط المذكورة في حقول رأس الطلب عندما تم اختبارها على الخادم.
       </p>
       <p>
         <strong>413 Payload Too Large:</strong> يرفض الخادم معالجة طلب لأن حمولة الطلب أكبر مما يمكن أن يتعامل به الخادم.
       </p>
       <p>
         <strong>414 URI Too Long:</strong> يرفض الخادم خدمة الطلب لأن هدف الطلب أطول مما يمكن للخادم تفسيره.
       </p>
       <p>
         <strong>415 Unsupported Media Type:</strong> الخادم الأصلي يرفض خدمة الطلب لأن تنسيق الحمولة غير مدعوم.
       </p>
       <p>
         <strong>416 Range Not Satisfiable:</strong> طلب العميل جزءًا من الملف (خدمة البايت)، ولكن الخادم لا يمكنه توفير تلك الجزء.
       </p>
       <p>
         <strong>417 Expectation Failed:</strong> الخادم لا يمكنه تلبية متطلبات حقل الطلب المتوقع.
       </p>
       <p>
         <strong>418 I'm a teapot:</strong> أي محاولة لتحضير القهوة باستخدام إبريق شاي يجب أن تؤدي إلى رمز الخطأ "418 I'm a teapot".
       </p>
       <p>
         <strong>420 Enhance Your Calm:</strong> تم إرجاعه بواسطة Twitter Search and Trends API عندما يتم تقييد معدل الوصول الخاص بالعميل.
       </p>
       <p>
         <strong>421 Misdirected Request:</strong> كان الطلب موجهًا إلى خادم غير قادر على إنتاج استجابة.
       </p>
       <p>
         <strong>422 Unprocessable Entity:</strong> كان الطلب متكونًا بشكل جيد ولكنه لم يتمكن من المتابعة بسبب أخطاء دلالية.
       </p>
       <p>
         <strong>423 Locked:</strong> المورد الذي يتم الوصول إليه مقفول.
       </p>
       <p>
         <strong>425 Too Early:</strong> يشير إلى أن الخادم غير مستعد لتحمل مخاطر معالجة طلب قد يتم إعادة تشغيله.
       </p>
       <p>
         <strong>426 Upgrade Required:</strong> يرفض الخادم أداء الطلب باستخدام البروتوكول الحالي ولكن قد يكون مستعدًا للقيام بذلك بعد ترقية العميل إلى بروتوكول مختلف.
       </p>
       <p>
         <strong>428 Precondition Required:</strong> يتطلب الخادم الأصلي أن يكون الطلب شرطيًا.
       </p>
       <p>
         <strong>429 Too Many Requests:</strong> قام المستخدم بإرسال الكثير من الطلبات في فترة زمنية معينة.
       </p>
      

     {/* استجابات أخطاء الخادم (500 – 599) */}
      
       <h3>استجابات أخطاء الخادم (500 – 599)</h3>
       <p>
         <strong>500 Internal Server Error:</strong> رسالة خطأ عامة، تُعطى عندما يتم مواجهة حالة غير متوقعة ولا يوجد رسالة أكثر تحديدًا مناسبة. هذا خطأ عام جدًا يمكن أن يتسبب فيه مجموعة واسعة من المشاكل على جانب الخادم.
       </p>
       <p>
         <strong>501 Not Implemented:</strong> الخادم إما لا يعرف طريقة الطلب المستخدمة، أو يفتقر إلى القدرة على تحقيق الطلب.
       </p>
       <p>
         <strong>502 Bad Gateway:</strong> الخادم، أثناء التصرف كبوابة أو وكيل، تلقى استجابة غير صالحة من الخادم العلوي الذي تم الوصول إليه في محاولة لتحقيق الطلب.
       </p>
       <p>
         <strong>503 Service Unavailable:</strong> الخادم غير قادر حاليًا على معالجة الطلب بسبب حملة مؤقتة أو صيانة للخادم.
       </p>
       <p>
         <strong>504 Gateway Timeout:</strong> الخادم، أثناء التصرف كبوابة أو وكيل، لم يتلقَ استجابة في الوقت المناسب من الخادم العلوي المحدد بواسطة URI أو بعض الخوادم المساعدة الأخرى التي كانت تحتاج إلى الوصول إليها لإكمال الطلب.
       </p>
       <p>
         <strong>505 HTTP Version Not Supported:</strong> الخادم لا يدعم، أو يرفض دعم، الإصدار الرئيسي لـ HTTP الذي تم استخدامه في رسالة الطلب.
       </p>
       <p>
         <strong>506 Variant Also Negotiates:</strong> الخادم لديه خطأ في التكوين الداخلي: المورد البديل المختار مكون للمشاركة في التفاوض الشفاف عن المحتوى بنفسه، وبالتالي ليس نقطة نهاية صحيحة في عملية التفاوض.
       </p>
       <p>
         <strong>507 Insufficient Storage:</strong> الخادم غير قادر على تخزين التمثيل المطلوب لإكمال الطلب.
       </p>
       <p>
         <strong>508 Loop Detected:</strong> الخادم اكتشف حلقة لانهائية أثناء معالجة الطلب.
       </p>
       <p>
         <strong>510 Not Extended:</strong> مطلوب مزيد من التمديدات للطلب ليتمكن الخادم من تحقيقه.
       </p>
       <p>
         <strong>511 Network Authentication Required:</strong> يحتاج العميل إلى المصادقة للحصول على الوصول إلى الشبكة.
       </p>

       <b><p>* النص المكتوب بمساعدة المترجم. إذا وجدت خطأ، يرجى إعلامنا *</p></b>
    <div className='ads-container'>  
  {/*  реклама  */}
</div>

    </div>
  )
}

export default ArReact_10;