import React from 'react';

function ElHtml_2() {
  return (
    <div>
      <div className='ad-container'>  
          {/*  реклама  */}
        </div> 

       <h1>Ετικέτες HTML και οι περιγραφές τους:</h1>

       <p>1. <b>{'<'}<span className='green'>html</span>{'>'}</b> Καθορίζει ένα έγγραφο HTML.</p>

       <p>2. <b>{'<'}<span className='green'>head</span>{'>'}</b> Περιέχει μεταδεδομένα σχετικά με το έγγραφο, όπως τον τίτλο και συνδέσμους σε φύλλα στυλ CSS.</p >

       <p>3. <b>{'<'}<span className='green'>title</span>{'>'}</b> Καθορίζει τον τίτλο του εγγράφου, ο οποίος εμφανίζεται στον τίτλο ή την καρτέλα του παραθύρου του προγράμματος περιήγησης.</p>

       <p>4. <b>{'<'}<span className='green'>body</span>{'>'}</b> Περιέχει το ορατό περιεχόμενο του εγγράφου.</p>

       <p>5. <b>{'<'}<span className='green'>h1</span>{'>'} - {'<'}<span className='green'>h6</span>{'>'} </b> Ορίστε επικεφαλίδες διαφορετικών επιπέδων σπουδαιότητας, με το {'<h1>'} να είναι το πιο σημαντικό και το {'<h6>'} το λιγότερο σημαντικό.</p>

<p>6. <b>{'<'}<span className='green'>p</span>{'>'}</b> Ορίζει μια παράγραφο κειμένου.</p>

<p>7. <b>{'<'}<span className='green'>a</span>{'>'}</b> Καθορίζει μια υπερ-σύνδεση προς μια άλλη ιστοσελίδα ή σε μια συγκεκριμένη τοποθεσία στην ίδια σελίδα.</p>

<p>8. <b>{'<'}<span className='green'>img</span>{'>'}</b> Εισάγει μια εικόνα σε ένα έγγραφο.</p>

<p>9. <b>{'<'}<span className='green'>ul</span>{'>'}</b> Καθορίζει μια μη ταξινομημένη λίστα, που συνήθως υποδεικνύεται με κουκκίδες.</p>

<p>10. <b>{'<'}<span className='green'>ol</span>{'>'}</b> Καθορίζει μια ταξινομημένη λίστα, που συνήθως υποδεικνύεται με αριθμούς ή γράμματα.</p>

<p>11. <b>{'<'}<span className='green'>li</span>{'>'}</b> Προσδιορίζει ένα στοιχείο λίστας σε μια ταξινομημένη ή μη ταξινομημένη λίστα.</p>

<p>12. <b>{'<'}<span className='green'>div</span>{'>'}</b> Καθορίζει ένα κοντέινερ για στοιχεία HTML που μπορεί να χρησιμοποιηθεί για στυλ και τοποθέτηση.</p>

<p>13. <b>{'<'}<span className='green'>span</span>{'>'}</b> Καθορίζει ένα μικρό κοντέινερ για ενσωματωμένα στοιχεία HTML που μπορούν να χρησιμοποιηθούν για στυλ και τοποθέτηση.</p>

<p>14. <b>{'<'}<span className='green'>form</span>{'>'}</b> Καθορίζει μια φόρμα για εισαγωγή χρήστη που μπορεί να περιέχει διάφορα πεδία εισαγωγής και κουμπιά υποβολής.</p>

<p>15. <b>{'<'}<span className='green'>input</span>{'>'}</b> Καθορίζει ένα πεδίο εισαγωγής για εισαγωγή χρήστη, όπως ένα πλαίσιο κειμένου ή ένα πλαίσιο ελέγχου.</p>

<p>16. <b>{'<'}<span className='green'>button</span>{'>'}</b> Καθορίζει ένα στοιχείο κουμπιού με δυνατότητα κλικ που μπορεί να χρησιμοποιηθεί για διάφορες αλληλεπιδράσεις με τους χρήστες.</p> 
    
<p>17. <b>{'<'}<span className='green'>select</span>{'>'}</b>  Καθορίζει μια αναπτυσσόμενη λίστα που επιτρέπει στους χρήστες να επιλέξουν μία ή περισσότερες επιλογές.</p>   
    
<p>18. <b>{'<'}<span className='green'>small</span>{'>'}</b> χρησιμοποιείται για τον καθορισμό μικρότερου μεγέθους κειμένου (για παράδειγμα, για την ένδειξη πνευματικών δικαιωμάτων και άλλων σχολίων).</p> 
  
<p><a href="https://www.w3schools.com/tags/" target='_blank' > <b>Περισσότερες ετικέτες μπορείτε να βρείτε εδώ 👉🏼 W3Schools</b></a></p>


<h2>Ετικέτες και χαρακτηριστικά πίνακα HTML</h2>

 
  <p>1. <b>{'<'}<span className='green'>table</span>{'>'}</b> Χρησιμοποιείται για να ορίσει την αρχή και το τέλος ενός πίνακα HTML. Όλες οι ετικέτες που σχετίζονται με έναν πίνακα περιέχονται στο στοιχείο {'<table>'}.</p>

  <p>2. <b>{'<'}<span className='green'>caption</span>{'>'}</b> Χρησιμοποιείται για την παροχή τίτλου ή λεζάντας για έναν πίνακα. Πρέπει να τοποθετηθεί αμέσως μετά την ετικέτα ανοίγματος {'<πίνακας>'}.</p>

  <p>3. <b>{'<'}<span className='green'>frame</span>{'>'}</b> Καθορίζει πώς θα εμφανίζονται τα περιγράμματα του πίνακα. Έχει τρεις πιθανές τιμές: void, above και below.</p>

  <p>4. <b>{'<'}<span className='green'>rules</span>{'>'}</b>  Καθορίζει την ορατότητα των περιγραμμάτων του πίνακα. Μπορεί να οριστεί σε "none" για απόκρυψη περιγραμμάτων, "groups" για εμφάνιση περιγραμμάτων μεταξύ ομάδων σειρών και ομάδων στηλών ή "rows" για εμφάνιση περιγραμμάτων μεταξύ σειρών.</p>

  <p>5. <b>{'<'}<span className='green'>border</span>{'>'}</b> Καθορίζει το πλάτος των περιγραμμάτων του πίνακα σε pixel.</p>

  <p>6. <b>{'<'}<span className='green'>cellspacing</span>{'>'}</b> Καθορίζει την απόσταση μεταξύ γειτονικών κελιών σε έναν πίνακα. Καθορίζεται σε pixel.</p>

  <p>7. <b>{'<'}<span className='green'>cellpadding</span>{'>'}</b> Καθορίζει την απόσταση μεταξύ των περιεχομένων του κελιού και των ορίων του κελιού. Καθορίζεται επίσης σε pixel.</p>

  <p>8. <b>{'<'}<span className='green'>tr</span>{'>'}</b> Χρησιμοποιείται για τον ορισμό μιας γραμμής πίνακα.</p>

  <p>9. <b>{'<'}<span className='green'>th</span>{'>'}</b> Χρησιμοποιείται για τον καθορισμό του τίτλου του κελιού του πίνακα. Συνήθως χρησιμοποιείται για τις επικεφαλίδες κάθε στήλης σε έναν πίνακα.</p>

  <p>10. <b>{'<'}<span className='green'>td</span>{'>'}</b> Χρησιμοποιείται για τον ορισμό ενός κελιού δεδομένων πίνακα. Εδώ πηγαίνει το πραγματικό περιεχόμενο του πίνακα.</p>


  <h2>Σύνδεσμοι ή σύνδεσμοι υπερκειμένου</h2>

  <p>Σύνδεσμοι ή σύνδεσμοι υπερκειμένου σε HTML χρησιμοποιούνται για τη δημιουργία στοιχείων με δυνατότητα κλικ σε μια ιστοσελίδα που επιτρέπουν στους χρήστες να μεταβούν σε άλλες σελίδες, ενότητες της ίδιας σελίδας ή άλλους διαδικτυακούς πόρους. Η βασική δομή ενός συνδέσμου αποτελείται από μια ετικέτα αγκύρωσης {'(<a>)'} και ένα χαρακτηριστικό href που καθορίζει τον προορισμό του συνδέσμου.</p> 

  <p>Ακολουθεί ένα παράδειγμα βασικού συνδέσμου σε HTML:</p>

<code><p>{'<'}<span className='green'>a</span> <span className='blue'>href</span>=<span className='blue1'>"https://www.example.com"</span>{'>'}Κάντε κλικ εδώ για να επισκεφτείτε το Example.com{'</'}<span className='green'>a</span>{'>'}</p></code>

<p>Σε αυτό το παράδειγμα, το κείμενο "Κάντε κλικ εδώ για να επισκεφτείτε το Example.com" είναι το τμήμα του συνδέσμου με δυνατότητα κλικ και το χαρακτηριστικό href καθορίζει τη διεύθυνση URL προορισμού. Όταν γίνει κλικ στον σύνδεσμο, ο χρήστης θα ανακατευθυνθεί στον ιστότοπο με την καθορισμένη διεύθυνση URL.</p>

<p>Οι σύνδεσμοι μπορούν επίσης να χρησιμοποιηθούν για τη δημιουργία σημείων αγκύρωσης σε μία μόνο ιστοσελίδα. Αυτό επιτρέπει στους χρήστες να μεταβούν γρήγορα σε μια συγκεκριμένη ενότητα μιας σελίδας κάνοντας κλικ σε έναν σύνδεσμο. Για να δημιουργήσετε ένα σημείο αγκύρωσης, πρέπει να προσθέσετε ένα χαρακτηριστικό <b>id</b> στο στοιχείο στο οποίο θέλετε να συνδεθείτε και, στη συνέχεια, να δημιουργήσετε τον σύνδεσμο με τον χαρακτήρα <b>#</b>ακολουθούμενο από το <b>id</b> τιμή ως προορισμός.</p>

<code>
      <p>{'<'}<span className='green'>h2</span> <span className='blue'>id</span>=<span className='blue1'>"section1"</span>{'>'}Τμήμα 1{'</'}<span className='green'>h2 </span>{'>'}</p>

      <p>{'<'}<span className='green'>p</span>{'>'}Αυτή είναι η πρώτη ενότητα της σελίδας.{'</'}<span className='green'>p</span>{'>'}</p>

      <p>{'<'}<span className='green'>h2</span> <span className='blue'>id</span>=<span className='blue1'>"section2"</span>{'>'}Τομέας 2{'</'}<span className='green'>h2 </span>{'>'}</p>

      <p>{'<'}<span className='green'>p</span>{'>'}Αυτή είναι η δεύτερη ενότητα της σελίδας.{'</'}<span className='green'>p</span>{'>'}</p>

      <p>{'<'}<span className='green'>a</span> <span className='blue'>href</span>=<span className='blue1'>"#section1"</span>{'>'}Μεταβείτε στην ενότητα 1{'</'}<span className='green'>a</span>{'>'}</p>

      <p>{'<'}<span className='green'>a</span> <span className='blue'>href</span>=<span className='blue1'>"#section2"</span>{'>'}Μεταβείτε στην ενότητα 2{'</'}<span className='green'>a</span>{'>'}</p>
 </code>

 <p>Σε αυτό το παράδειγμα, προσθέσαμε χαρακτηριστικά <b>id</b> σε δύο ετικέτες <b>h2</b> για να δημιουργήσουμε σημεία αγκύρωσης για κάθε ενότητα. Οι δύο σύνδεσμοι στο κάτω μέρος της σελίδας χρησιμοποιούν το χαρακτηριστικό <b>href</b> για να συνδέσουν αυτά τα σημεία αγκύρωσης, επιτρέποντας στους χρήστες να μεταβούν γρήγορα σε μια συγκεκριμένη ενότητα της σελίδας.</p>

 <p>Υπάρχουν πολλές άλλες παράμετροι και χαρακτηριστικά σε HTML που μπορούν να χρησιμοποιηθούν σε συνδέσμους, όπως target, download, rel και άλλα. Η αποτελεσματική χρήση των συνδέσμων σάς επιτρέπει να δημιουργήσετε μια πιο διαδραστική και ελκυστική εμπειρία χρήστη στις ιστοσελίδες σας.</p>

 <p>Για να δημιουργήσετε έναν σύνδεσμο για έναν αριθμό τηλεφώνου ή Skype, μπορείτε να χρησιμοποιήσετε την ετικέτα {'<a>'} με το χαρακτηριστικό <b>href</b> να έχει οριστεί σε <b>"τηλ:"</b> ή <b> "skype:"</b>ακολουθείται από τον αριθμό τηλεφώνου ή το όνομα χρήστη Skype.</p>

 <p>Για παράδειγμα, για να δημιουργήσετε έναν σύνδεσμο για έναν αριθμό τηλεφώνου, μπορείτε να χρησιμοποιήσετε τον ακόλουθο κώδικα:</p>

 <code><p>{'<'}<span className='green'>a</span> <span className='blue'>href</span>=<span className='blue1'>"tel:+ 1234567890"</span>{'>'} Καλέστε μας στο +1 (234) 567-890{'</'}<span className='green'>a</span>{'>'}</p> </code>

 <p>Σε αυτό το παράδειγμα, το <b>"tel:"</b> χρησιμοποιείται ως πρωτόκολλο για αριθμούς τηλεφώνου και το "+1234567890" είναι ο ίδιος ο αριθμός τηλεφώνου. Όταν ένας χρήστης κάνει κλικ σε αυτόν τον σύνδεσμο σε μια κινητή συσκευή, εκκινεί αυτόματα την εφαρμογή τηλεφώνου με έναν προσυμπληρωμένο αριθμό.</p>

 <p>Για να δημιουργήσετε έναν σύνδεσμο για το Skype, μπορείτε να χρησιμοποιήσετε τον ακόλουθο κώδικα:</p>

<code><p>{'<'}<span className='green'>a</span> <span className='blue'>href</span>=<span className='blue1'>"skype:username?call"</span>{'>'}Καλέστε μας στο Skype{'</'}<span className='green'>a</span>{'>'}</p></code>

<p>Σε αυτό το παράδειγμα, το <b>"skype:"</b> χρησιμοποιείται ως πρωτόκολλο για συνδέσμους Skype, το "username" είναι το όνομα χρήστη του ατόμου ή της εταιρείας που θέλετε να καλέσετε και προστίθεται το "?call" για να ξεκινήσετε την κλήση. Όταν ένας χρήστης κάνει κλικ σε αυτόν τον σύνδεσμο, εκκινεί την εφαρμογή Skype και ξεκινά μια κλήση προς το καθορισμένο όνομα χρήστη.</p>

<p><b>Η ετικέτα {'<img>'} σε HTML χρησιμοποιείται για την εμφάνιση εικόνων σε μια ιστοσελίδα. Ακολουθεί ένα παράδειγμα χρήσης της ετικέτας {'<img>'}</b></p>

<code><p>{'<'}<span className='green'>img</span> <span className='blue'>src</span>=<span className='blue1'>"image.jpg"</span> <span className='blue'>alt</span>=<span className='blue1'>"Description of image"</span>{'>'}</p></code>

<p>Ας δούμε τα διάφορα μέρη αυτής της ετικέτας:</p>

<p>Το χαρακτηριστικό <b>"src"</b> καθορίζει τη διεύθυνση URL του αρχείου εικόνας που θέλετε να εμφανίσετε.</p>

<p>Το χαρακτηριστικό <b>"alt"</b> παρέχει μια περιγραφή της εικόνας για προγράμματα ανάγνωσης οθόνης και άλλες βοηθητικές τεχνολογίες.</p>
 
<p>Ακολουθεί ένα παράδειγμα χρήσης της ετικέτας {'<img>'} για την εμφάνιση μιας εικόνας με συγκεκριμένο πλάτος και ύψος:</p>

<code><p>{'<'}<span className='green'>img</span> <span className='blue'>src</span>=<span className='blue1'>"image.jpg"</span> <span className='blue'>alt</span>=<span className='blue1'>"Description of image"</span> <span className='blue'>width</span>=<span className='blue1'>"500"</span> <span className='blue'>height</span>=<span className='blue1'>"300"</span>{'>'}</p></code>

<p>Σε αυτό το παράδειγμα, τα χαρακτηριστικά <b>"width"</b> και <b>"height"</b> καθορίζουν τις διαστάσεις της εικόνας σε pixel.</p>

<p>Μπορείτε επίσης να προσθέσετε άλλα χαρακτηριστικά στην ετικέτα {'<img>'} για να προσαρμόσετε περαιτέρω την εμφάνιση της εικόνας, όπως <b>"class"</b> και <b>"id"</b> για στυλ με χρήση CSS.</p>

<b><p>* Κείμενο γραμμένο με τη βοήθεια ενός μεταφραστή. Αν βρείτε κάποιο σφάλμα, παρακαλούμε ενημερώστε μας *</p></b>
    <div className='ads-container'>  
  {/*  реклама  */}
</div>
    </div>
  )
}

export default ElHtml_2;