import React from 'react';

function InHtml_3() {
  return (
    <div>
      <div className='ad-container'>  
          {/*  реклама  */}
        </div> 

<h1>HTML में मेटा टैग को समझना - नवादेश के लिए एक मार्गदर्शिका</h1>

<p>1. <b>charset:</b> charset विशेषता एचटीएमएल दस्तावेज़ के लिए वर्ण संदर्भ सेट करती है। यह महत्वपूर्ण है कि सुनिश्चित किया जाए कि कोडिंग सही ढंग से सेट की गई है ताकि विशेष वर्णों को सही ढंग से प्रदर्शित किया जा सके।</p>

<p>उदाहरण:</p>

<code><p>{'<'}<span className='green'>meta</span> <span className='blue'>charset</span>=<span className='blue1'>"UTF-8"</span>{'>'}</p></code>

<p>2. <b>name:</b> नाम विशेषता का उपयोग मेटाडेटा प्रदान किया जाने वाले प्रकार को परिभाषित करने के लिए किया जाता है, जैसे कीवर्ड, विवरण, या लेखक।</p>

<p>उदाहरण:</p>

<code><p>{'<'}<span className='green'>meta</span> <span className='blue'>name</span>=<span className='blue1'>"description"</span> <span className='blue'>content</span>=<span className='blue1'>"यह मेरी वेब पेज का विवरण है।"</span>{'>'}</p></code>

<p>3. <b>content:</b> content विशेषता का उपयोग प्रदान किए जा रहे मेटाडेटा के मूल्य को निर्दिष्ट करने के लिए किया जाता है।</p>

<p>उदाहरण:</p>

<code><p>{'<'}<span className='green'>meta</span> <span className='blue'>name</span>=<span className='blue1'>"keywords"</span> <span className='blue'>content</span>=<span className='blue1'>"एचटीएमएल, सीएसएस, जावास्क्रिप्ट"</span>{'>'}</p></code>

<p>4. <b>http-equiv:</b> http-equiv विशेषता एचटीएमएल दस्तावेज़ के लिए एचटीटीपी हैडर को परिभाषित करने के लिए प्रयुक्त किया जाता है, जैसे कि ताजगी या सामग्री-प्रकार</p>

<p>उदाहरण:</p>

<code><p>{'<'}<span className='green'>meta</span> <span className='blue'>http-equiv</span>=<span className='blue1'>"refresh"</span> <span className='blue'>content</span>=<span className='blue1'>"5"</span>{'>'}</p></code>
  
<p>5. <b>viewport:</b> viewport विशेषता का उपयोग विभिन्न उपकरणों पर एक वेब पृष्ठ के लेआउट और स्केलिंग को नियंत्रित करने के लिए किया जाता है, जैसे मोबाइल फोन या टैबलेट।</p>

<p>उदाहरण:</p>

<code><p>{'<'}<span className='green'>meta</span> <span className='blue'>name</span>=<span className='blue1'>"viewport"</span> <span className='blue'>content</span>=<span className='blue1'>"विथ=device-width, प्रारंभिक-स्केल=1.0"</span>{'>'}</p></code>

<h2>HTML में रंग का उपयोग कैसे करें: एक शुरुआती गाइड।</h2>

<p>HTML में रंग को विभिन्न तरीकों से परिभाषित किया जा सकता है, जैसे की रंग नाम, हेक्साडेसिमल मान, आरजीबी मान, और एचएसएल मान।</p>

<b>1. रंग नाम:</b>

<p>HTML एक सेट पूर्वनिर्धारित रंग नाम प्रदान करता है जो किसी तत्व के रंग को निर्दिष्ट करने के लिए उपयोग किया जा सकता है। कुछ रंग नामों के उदाहरण हैं "लाल", "हरा", "नीला", "पीला", "बैंगनी", और "काला"।</p>

<b>2. हेक्साडेसिमल मान:</b>

<p>हेक्साडेसिमल रंग मान एक छह-अंकीय कोड होता है जो एक रंग को प्रतिनिधित करता है। पहले दो अंक रंग में लाल की मात्रा को प्रतिनिधित करते हैं, अगले दो अंक हरे की मात्रा को प्रतिनिधित करते हैं, और अंतिम दो अंक नीले की मात्रा को प्रतिनिधित करते हैं। उदाहरण के लिए, #FF0000 पूर्ण लाल को प्रतिनिधित करता है, #00FF00 पूर्ण हरा को प्रतिनिधित करता है, और #0000FF पूर्ण नीला को प्रतिनिधित करता है।</p>

<b>3. आरजीबी मान:</b>

<p>आरजीबी रंग मान एक सेट है जो किसी रंग में लाल, हरे, और नीले की मात्रा को प्रतिनिधित करता है। प्रत्येक मान 0 से 255 तक का होता है। उदाहरण के लिए, rgb(255, 0, 0) पूर्ण लाल को प्रतिनिधित करता है, rgb(0, 255, 0) पूर्ण हरा को प्रतिनिधित करता है, और rgb(0, 0, 255) पूर्ण नीला को प्रतिनिधित करता है।</p>

<b>4. एचएसएल मान:</b>

<p>एचएसएल रंग मान एक सेट है जो किसी रंग की रंगता, थोसता, और प्रकाशता को प्रतिनिधित करता है। रंगता एक डिग्री है जो रंग चक्र पर होती है (0 से 360 तक), थोसता एक प्रतिशत मूल्य होता है (0% से 100%), और प्रकाशता भी एक प्रतिशत मूल्य होता है (0% से 100%)। उदाहरण के लिए, hsl(0, 100%, 50%) पूर्ण लाल को प्रतिनिधित करता है, hsl(120, 100%, 50%) पूर्ण हरा को प्रतिनिधित करता है, और hsl(240, 100%, 50%) पूर्ण नीला को प्रतिनिधित करता है।</p>

<h2>शुरुआती लिए सीएसएस मूल अवधारणाएँ: कैस्केडिंग स्टाइल शीट्स का परिचय</h2>

<p>सीएसएस का अर्थ होता है कैस्केडिंग स्टाइल शीट्स और यह एक भाषा है जो एचटीएमएल दस्तावेज़ को स्टाइल करने के लिए उपयोग की जाती है। सीएसएस आपको अपने वेबपेज के रंग, फोंट, लेआउट, और अन्य पहलुओं को बदलने की अनुमति देती है। यह एचटीएमएल तत्वों का चयन करके उन पर स्टाइल लगाने के द्वारा काम करती है।</p>

<p>सीएसएस स्टाइल सेलेक्टर्स, गुण, और मान का उपयोग करके बनाए जाते हैं। सेलेक्टर्स विशिष्ट एचटीएमएल तत्वों को लक्ष्य करते हैं और उन पर स्टाइल लागू करने के लिए उपयोग किए जा सकते हैं। गुण यह परिभाषित करते हैं कि आप किस प्रकार की स्टाइल लागू करना चाहते हैं और इसमें फॉन्ट साइज, रंग, और पैडिंग जैसी चीजें शामिल हो सकती हैं। मान गुण के लिए विशेष सेटिंग्स को निर्दिष्ट करते हैं, जैसे कि विशेष रंग या आकार।</p>

<p>एक सीएसएस फ़ाइल को एक एचटीएमएल दस्तावेज़ से लिंक करने के लिए, आप अपने एचटीएमएल दस्तावेज़ के {'<head>'} खंड में {'<link>'} टैग का उपयोग कर सकते हैं।</p>

<p>यहाँ एक उदाहरण है कि अपने एचटीएमएल दस्तावेज़ को "styles.css" कहलाने वाली एक सीएसएस फ़ाइल से कैसे लिंक करें:</p>

<code>
      <p>{'<'}!<span className='blue'>DOCTYPE</span> <span className='blue1'>html</span>{'>'}</p>

      <p>{'<'}<span className='green'>html</span>{'>'}</p> 

      <p>{'<'}<span className='green'>head</span>{'>'}</p>

      <p>&nbsp;{'<'}<span className='green'>link</span> <span className='blue'>rel</span>=<span className='blue1'>"stylesheet"</span> <span className='blue'>type</span>=<span className='blue1'>"text/css"</span> <span className='blue'>href</span>=<span className='blue1'>"styles.css"</span>{'>'}</p>

      <p>{'</'}<span className='green'>head</span>{'>'}</p>

      <p>{'<'}<span className='green'>body</span>{'>'}</p>

      <p>&nbsp;{'<!-- यहाँ आपका एचटीएमएल सामग्री है -->'}</p>

      <p>{'</'}<span className='green'>body</span>{'>'}</p>

      <p>{'</'}<span className='green'>html</span>{'>'}</p>
    </code>


    
    <p>यहाँ एक सीएसएस कोड का उदाहरण है:</p>

  <code>
    <p>{'h1 {'}</p>

    <p><span className='blue'>color</span>: <span className='blue1'>लाल</span>;</p>

    <p><span className='blue'>font-size</span>: <span className='blue1'>36px</span>; </p>

    <p><span className='blue'>text-align</span>: <span className='blue1'>केंद्र</span>; </p>

    <p>{'}'}</p>

    <p>{'p {'}</p>

    <p><span className='blue'>color</span>: <span className='blue1'>नीला</span>; </p>

    <p> <span className='blue'>font-size</span>: <span className='blue1'>16px</span>;</p>

    <p><span className='blue'>line-height</span>: <span className='blue1'>1.5</span>;</p>

    <p>{'}'}</p>
   </code>

    <p>इस कोड में, हमारे पास दो सेलेक्टर <b>(h1 और p)</b> हैं और प्रत्येक पर कई गुण और मान लागू होते हैं। <b>h1</b> सेलेक्टर को सभी पृष्ठ पर हर <b>h1</b> तत्व पर लाल रंग, 36px फ़ॉन्ट आकार, और केंद्रित पाठ संरेखण लागू होता है। <b>p</b> सेलेक्टर को सभी पृष्ठ पर हर <b>p</b> तत्व पर नीला रंग, 16px फ़ॉन्ट आकार, और 1.5 लाइन उचाई लागू होती है।</p>

    <p>सीएसएस को एचटीएमएल दस्तावेज़ों में कई तरीकों से लागू किया जा सकता है, जैसे कि इनलाइन, एम्बेडेड, और बाह्य स्टाइलशीट्स। इनलाइन स्टाइल्स को एचटीएमएल तत्व पर स्टाइल विशेषता का उपयोग करके सीधे लागू किया जाता है। एम्बेडेड स्टाइल्स को एचटीएमएल दस्तावेज़ के <b>head</b> खंड में स्टाइल टैग का उपयोग करके रखा जाता है। बाह्य स्टाइलशीट्स अलग सीएसएस फ़ाइलों में संग्रहीत होते हैं और उन्हें एचटीएमएल दस्तावेज़ से लिंक किया जाता है, जिसमें <b>link</b> टैग का उपयोग किया जाता है।</p>
  
  <b><p>*  यह टेक्स्ट अनुवादक की मदद से लिखा गया है। यदि आपको कोई गलती मिलती है, तो कृपया हमें बताएं  *</p></b>
  
  <div className='ads-container'>  
  {/*  реклама  */}
</div> 
    </div>
  )
}

export default InHtml_3;