import React from 'react';

function KyHtml_2() {
  return (
    <div>
       <div className='ad-container'>  
          {/*  реклама  */}
        </div> 
        
        <h1>HTML тегдери жана анын маалыматтары:</h1>

<p>1. <b>{'<'}<span className='green'>html</span>{'>'}</b>HTML документин аныктайт.</p>

<p>2. <b>{'<'}<span className='green'>head</span>{'>'}</b>Документтин мета-маалыматтарын (мисалы, аталыш жана CSS стилдерге сылталар) ичинде турат.</p>

<p>3. <b>{'<'}<span className='green'>title</span>{'>'}</b>Документтин аталышын аныктайт, браузердин аталышы баракчасында же тапсырыш битинде көрүнөт.</p>

<p>4. <b>{'<'}<span className='green'>body</span>{'>'}</b>Документтин көрүнүшү кандай.</p>

<p>5. <b>{'<'}<span className='green'>h1</span>{'>'} - {'<'}<span className='green'>h6</span>{'>'}</b>Фарклы маанилерде баштапкы загварларды аныктайт, {'<h1>'} эң маанилүү болуп, {'<h6>'} эң аз маанилүү болуп саналат. </p>

<p>6. <b>{'<'}<span className='green'>p</span>{'>'}</b>Мәтин булагын аныктайт.</p>

<p>7. <b>{'<'}<span className='green'>a</span>{'>'}</b>Башка баракчада же ага баракта көчүлбөй тизмени аныктайт.</p>

<p>8. <b>{'<'}<span className='green'>img</span>{'>'}</b>Документке сүрөт киргизет.</p>

<p>9. <b>{'<'}<span className='green'>ul</span>{'>'}</b>Топту жана чирпүүлөр менен белгилең тизмесин аныктайт.</p>

<p>10. <b>{'<'}<span className='green'>ol</span>{'>'}</b>Топтун төрағалуучу тизмесин аныктайт, кийинчи топ же мекендүүлүүлөр менен белгилең.</p>

<p>11. <b>{'<'}<span className='green'>li</span>{'>'}</b>Төрағалуучу же чирпүүлөрдүн ичиндеги тизме элементин аныктайт.</p>

<p>12. <b>{'<'}<span className='green'>div</span>{'>'}</b>HTML элементтери үчүн контейнерди аныктайт, аны стилдөө жана орнотууда колдонула алат.</p>

<p>13. <b>{'<'}<span className='green'>span</span>{'>'}</b>Инлайн HTML элементтери үчүн жогорку контейнерди аныктайт, аны стилдөө жана орнотууда колдонула алат.</p>

<p>14. <b>{'<'}<span className='green'>form</span>{'>'}</b>Пайдалануучунун киргизүүсү үчүн форманы аныктайт, аны берген киргизүү талаалары жана жиберүү баскычтарын ич киришет.</p>

<p>15. <b>{'<'}<span className='green'>input</span>{'>'}</b>Пайдалануучунун киргизүүсү үчүн киргизүү талаасын аныктайт, мисалы, текст кошуу жолун же талдоо баскычын аныктайт.</p>

<p>16. <b>{'<'}<span className='green'>button</span>{'>'}</b>Тез кыймылчы кнопка элементин аныктайт, аны бир нече пайдалануучу байланыштары үчүн колдонула алат.</p>

<p>17. <b>{'<'}<span className='green'>select</span>{'>'}</b>Тизмени киргизүүчү, бул колдонуучуларга бир нече параметрлерди тандоо мүмкүнчүлүгү берет.</p>

<p>18. <b>{'<'}<span className='green'>option</span>{'>'}</b>Тизмениң ичиндеги бир параметрди аныктайт.</p>

 <p>19. <b>{'<'}<span className='green'>textarea</span>{'>'}</b>Көбүрөөк мәтин киргизүү талаасын аныктайт.</p>

 <p>20. <b>{'<'}<span className='green'>hr</span>{'>'}</b> "горизонталдык белги" деген сөздүн кыскалары. Бул HTML баракчасына горизонталдык шериги киргизүү үчүн колдонулат. Шерик көрүнүштү көрүнүштүрүү үчүн колдонулот.</p>

 <p>21. <b>{'<'}<span className='green'>br</span>{'>'}</b> "сап кыймылы" деген сөздүн кыскалары. HTML мазмунунда сап кыймылы же жаңы сап киргизүү үчүн колдонулат. {'<p>'} теги жаңы бир багыт үчүн, {'<br>'} теги тек жаңы сап киргизүү үчүн колдонулат.</p>

 <p>22. <b>{'<'}<span className='green'>small</span>{'>'}</b>Кийинчи текстти (мисалы, копирайт жана башка жаңылыктар) аныктайт.</p> 

 <p><a href="https://www.w3schools.com/tags/" target='_blank' > <b>Кошумча тегдер бул жерде табылышат 👉🏼 W3Schools</b></a></p>


<h2>HTML Кесте тегтери жана атрибуттары</h2>


 <p>1. <b>{'<'}<span className='green'>table</span>{'>'}</b>HTML кестесин ачуу менен аяктаган жана аяктаган HTML кестесин ачуу үчүн колдонулат. Бардык кесте менен байланыштуу тегдер {'<table>'} элементин ичинде бар.</p>

 <p>2. <b>{'<'}<span className='green'>caption</span>{'>'}</b>Кестенин аталышын же темасын көрсөтүү үчүн колдонулат. Бул бериш {'<table>'} тегинин кийинде тез алдында түзүлет.</p>

 <p>3. <b>{'<'}<span className='green'>frame</span>{'>'}</b>Кестенин четкердин өзгөчөлүктөрүн көрсөтүү үчүн колдонулат. Булдо төмөндөгү мүмкүнчүлүктөр бар: тоштук, жогорку жана төмөнкү.</p>

 <p>4. <b>{'<'}<span className='green'>rules</span>{'>'}</b>Кестенин четкердин көрүнүшүн белгилөө. "жок" деген сөз көрүнгөн четкерди жашыру үчүн, "топтар" тизмелери жана багандардын ортосунда четкердер көрсөтүү үчүн же "жолдор" тизмелер арасында четкердер көрсөтүү үчүн болот. Үч категориядагы мүмкүнчүлүктөрүн белгилөө.</p>

 <p>5. <b>{'<'}<span className='green'>border</span>{'>'}</b>Кестенин четкердин кеңдигин пикселдеги өлчөө. Бул пикселдеги.</p>

 <p>6. <b>{'<'}<span className='green'>cellspacing</span>{'>'}</b>Кестедеги жакын келүүчүлөр арасындагы бос оронун көрсөтүү. Бу пикселдеги.</p>

 <p>7. <b>{'<'}<span className='green'>cellpadding</span>{'>'}</b>Келишим мазмун жана келишим жакындыктары арасындагы бос оронун көрсөтүү. Бу пикселдеги.</p>

 <p>8. <b>{'<'}<span className='green'>tr</span>{'>'}</b>Кестенин бир жолун аныктайт.</p>

 <p>9. <b>{'<'}<span className='green'>th</span>{'>'}</b>Кестенин баш жолуна таандуу түймөнү аныктайт. Бу кестенин бардык жолдорундагы баштапкы таарынууда колдонулат.</p>

 <p>10. <b>{'<'}<span className='green'>td</span>{'>'}</b>Кестенин мазмунунын келишим түймөнү аныктайт. Бу кестенин мазмунуны койулгандар.</p>

 <h2>Шилтемелер же гипертексттик шилтемелер</h2>

<p>HTML дагы байланыстар же үйгөртүлүштөрдү колдонуш эсебилөөсү үчүн колдонулат. Булдан башка баракчада күзөтүлгөн элементтерди түзүүгө мүмкүндүк берет, ал тушумдордон башка баракчаларга, теңдемелерге же башка онлайн эсебилерге киришкөнүүлөргө мүмкүнчүлүк берет. Байланыштын антолуунун анатомиясы анкета теги {'(<a>)'} жана байланыштын максатын көрсөткөн href атрибуту камтыйт.</p> 

<p>Эле HTML дагы кыймылчы байланыштын байланыштын мисалы шулай:</p>

<code><p>{'<'}<span className='green'>a</span> <span className='blue'>href</span>=<span className='blue1'>"https://www.example.com"</span>{'>'}Example.com га кириңиз {'</'}<span className='green'>a</span>{'>'}</p></code>

<p>Бул мисалда, "Example.com га кириңиз" текст байланыштын басылаткан бөлүм болуп, href атрибуту байланыштын негизги URLин көрсөтөт. Пайдалануучу байланышка басканда, аны берилген URLдеги веб-сайтка келет.</p>

<p>Байланыштарды бир түзүмдүү баракча ичиндеги анкет нүктөлөрдү түзүү үчүн де колдонулуп жатат. Бул пайдалануучуларга бир баракчанын белгилүү бөлүмүнө тез чоңой баруучу байланышты кийинчи үчүн пайдалануу мүмкүнчүлүгүн берет. Анкет нүктөсүн түзүү үчүн, барактагы келген элементке id атрибутун кошуңуз, анан анкетке #символу менен көрсөтүлгөн id маанисин кошуңуз</p>

<code>
  <p>{'<'}<span className='green'>h2</span> <span className='blue'>id</span>=<span className='blue1'>"section1"</span>{'>'}Бөлүм 1{'</'}<span className='green'>h2 </span>{'>'}</p>

  <p>{'<'}<span className='green'>p</span>{'>'}Баракчанын биринчи бөлүмү бул.{'</'}<span className='green'>p</span>{'>'}</p>

  <p>{'<'}<span className='green'>h2</span> <span className='blue'>id</span>=<span className='blue1'>"section2"</span>{'>'}Бөлүм 2 {'</'}<span className='green'>h2 </span>{'>'}</p>

  <p>{'<'}<span className='green'>p</span>{'>'}Баракчанын экинчи бөлүмү бул.{'</'}<span className='green'>p</span>{'>'}</p>

  <p>{'<'}<span className='green'>a</span> <span className='blue'>href</span>=<span className='blue1'>"#section1"</span>{'>'}Бөлүм 1ге кириңиз{'</'}<span className='green'>a</span>{'>'}</p>

  <p>{'<'}<span className='green'>a</span> <span className='blue'>href</span>=<span className='blue1'>"#section2"</span>{'>'}Бөлүм 2ге кириңиз{'</'}<span className='green'>a</span>{'>'}</p>
</code>

<p>Бул мисалда, эки <b>h2</b> тегинин анкет атрибуттарын кошуп, көрсөткүч бөлүмдүн кийинки беттери үчүн анкет нүктөлөрдү түзүү үчүн колдонулуп жатат. Баракчанын астында көрсөтүлгөн эки байланыш бетинин башында анкет атрибутун колдонуп, пайдалануучуларга баракчанын көрсөткүч бөлүмдөрүнө тез чоңой кийинки бөлүмүне жетүү мүмкүнчүлүгүн берет.</p>

<p>HTML дагы байланыштар менен колдонулган башка көчмөнү жана атрибуттардын көптөгү варианттары бар, мисалы, target, download, rel жана башка. Байланыштарды жакшы колдонууга арналган, сиз веб барактарыңызда активдүү жана чабылган пайдалануучу кызмат көрсөтүүүн жасайсиз.</p>

<p>Телефон номери же Skype үчүн байланыш түзүү үчүн сиз {'<a>'} тегин колдонсоңуз же href атрибутун көрсөтүңүз <b>"tel:"</b> же <b>"skype:"</b> келген телефон номерин же Skype колдонуучу атынан кийин келген.</p>

<p>Мисалы, телефон номери үчүн байланыш түзүү үчүн сиз төмөнкү кодду колдонуңуз:</p>

<code><p>{'<'}<span className='green'>a</span> <span className='blue'>href</span>=<span className='blue1'>"tel:+1234567890"</span>{'>'}Бизге +1 (234) 567-890 номери боюнча чаңгыз{'</'}<span className='green'>a</span>{'>'}</p></code>

<p>Бул мисалда, телефон номери үчүн <b>"tel:"</b> протоколу колдонулган, "+1234567890" телефон номери. Пайдалануучу мобилдик үйдөн бул байланышка басканда, ал автоматтык түрдө телефондун номурасы белгиленген чөйрөнү ачат.</p>

<p>Skype үчүн байланыш түзүү үчүн сиз төмөнкү кодду колдонуңуз</p>

<code><p>{'<'}<span className='green'>a</span> <span className='blue'>href</span>=<span className='blue1'>"skype:username?call"</span>{'>'}Бизге Skype ортосунда чаңгыз{'</'}<span className='green'>a</span>{'>'}</p></code>

<p>Бул мисалда, Skype байланыштары үчүн <b>"skype:"</b> протоколу колдонулган, "username" чаңгычынын аты же компаниясы, сизге чаңгыз келет же "чаңгыз" боюнча өтүүлөрдү инициилаңыз. Пайдалануучу бул байланышка басканда, Skype аппаратын ачат жана берилген usernameге чаңгыз инициилаңыз.</p>

<p><b>HTML дагы {'<img>'} теги веб барактарында сүрөттөрдү көрсөтүү үчүн колдонулат. Иштейткен жерде {'<img>'} тегин колдонуунун мисали:</b></p>

<code><p>{'<'}<span className='green'>img</span> <span className='blue'>src</span>=<span className='blue1'>"image.jpg"</span> <span className='blue'>alt</span>=<span className='blue1'>"Сүрөттүн сүрөтү"</span>{'>'}</p></code>

<p>Бул тегдин бөлүмдөрүн чыгарыңыз:</p>

<p>"src" атрибуту көрсөткөн сүрөттүн URLин URLин көрсөтөт.</p>

<p>"alt" атрибуту сүрөттүн түштүк талап кылуучулар жана башка жардамкер технологиялар үчүн сүрөттүн сүрөтүн берет.</p>

<p>Сүрөттүн мөөлөмдү пикселде колдонулган {'<img>'} тегин колдонуп башка атрибуттарды кошуңуз, мисалы, CSS стилистики жолугу үчүн <b>"class"</b> жана <b>"id"</b>.</p>



<b><p>* Текст котормочунун жардамы менен жазылган. Эгер ката тапсаңыз, бизге кабарлаңыз *</p></b>
    <div className='ads-container'>  
  {/*  реклама  */}
</div>

    </div>
  )
}

export default KyHtml_2;