import React from 'react';

function kyProgramming_tips() {
  return (
    <div>
      <div className='ad-container'>  
          {/*  реклама  */}
        </div>
        
        <h1>Код редакторлорунун салышышы</h1>
       
       <h3>Notepad++, Sublime Text, Visual Studio Code, Atom, WebStorm</h3>
       
       <b>1. Notepad++</b>
       
       <p>+ Мубарак </p>
       
       <p>• Тез жана желдиктүү код редактору </p>
       
       <p>• Көптөрдүү программалаштыруу тили менен жана файл форматтары менен жумшактуу </p>
       
       <p>• Плагиндер менен жана скрипттер менен узартыла алат </p>
       
       <p>• Тегерек жана ачык код </p>
       
       <p>- Көптөр </p>
       
       <p>• Жамоочтуу башкаруу мүмкүндүктөрүн жогорулаштыруу </p>
       
       <p>• Интерфейс алдын ала жана бекитилбеген болушу мүмкүн </p>
       
       <p>• Чоң проекттер менен же коллаборативдуу иштеп чыгууда мүмкүн эмес </p>
       
       <p>Notepad++ программасын электрондук вебсайттан жүктөп аласыз:<a href=" https://notepad-plus-plus.org/" target='_blank' > 👉🏼 Notepad++</a></p>
       
       
       <b>2. Sublime Text</b>
       
       <p>+ Мубарак</p>
       
       <p>• Тез жана таануулуу код редактору</p>
       
       <p>• Көптөрдүү курсордорду дестелеги менен жана көптөрдүү издөө жана орнотуу функциясы менен багытталат </p>
       
       <p>• Чоң санда плагиндер менен темалар бар </p>
       
       <p>• Кичине жана чоң проекттер үчүн улантуу </p>
       
       <p>- Көптөр </p>
       
       <p>• Тегерек эмес (осмондук болуп белгиле, бирок он жамансыз окуу кызматы бар) </p>
       
       <p>• Жамоочтуу башкаруу мүмкүндүктөрүн жогорулаштыруу </p>
       
       <p>• Тегерек эмес макростор, маалыматтарды көбүрөөктиги чечим менен жана проекттер менен </p>
       
       <p>Sublime Text программасын электрондук вебсайттан жүктөп аласыз: <a href="https://www.sublimetext.com/" target='_blank' > 👉🏼 Sublime Text</a></p>
       
       <b>3. Visual Studio Code</b>
       
       <p>+ Мубарак</p>
       
       <p>• Шакталуу жана көптөр функционалдуу код редактору </p>
       
       <p>• Көптөрдүү программалаштыруу тили менен файл форматтарын дестелеги менен жумшактуу </p>
       
       <p>• Чоң санда плагиндер менен жана көптөрдүү үстүн ташуулар менен узартыла алат </p>
       
       <p>• Иштеп чыгуу үчүн киргизилген дебаглаштыруу кире алат менен Git интеграциясы </p>
       
       <p>- Көптөр </p>
       
       <p>• Тегерек эмес, чоң проекттер менен же көптөрдүү киргизмелер менен биргелештирилет </p>
       
       <p>• Базарды колдонуу үчүн манасы жогору күйгүзүү </p>
       
       <p>• Эки кең көргөзүү мүмкүнчүлүктөрү үчүн жиберме арттыруу</p>
       
       <p>Visual Studio Code программасын электрондук вебсайттан жүктөп аласыз: <a href="https://code.visualstudio.com/" target='_blank' > 👉🏼  Visual Studio Code</a> </p>
       
       <b>4. Atom</b>
       
       <p>+ Мубарак </p>
       
       <p>• Тегерек жана ачык код редактору, жаңы жана узартылаткан интерфейси бар </p>
       
       <p>• Көптөрдүү программалаштыруу тили менен файл форматтарын дестелеги менен жумшактуу </p>
       
       <p>• Чоң санда плагиндер менен жана пакеттер менен узартыла алат </p>
       
       <p>• Кичине жана чоң проекттер үчүн улантуу </p>
       
       <p>- Көптөр </p>
       
       <p>• Тегерек эмес, чоң проекттер менен же бир нече пакеттер менен көптөрдүү киргизмелер менен биргелештирилет </p>
       
       <p>• Катарынан кийинки жактырылган керек плагиндер менен бирге эмес функциялар </p>
       
       <p>• Интерфейс кийинкеткен же жауабы жок болушу мүмкүн </p>
       
       <p>Atom программасын электрондук вебсайттан жүктөп аласыз:<a href="https://atom.io/" target='_blank' > 👉🏼 Atom</a></p>
       
       <b>5. WebStorm</b>
       
       <p>• Мубарак</p>
       
       <p>• Вебдеги иштеп чыгуу үчүн жакшы киргизилген жана шакталган код редактору</p>
       
       <p>• Чоң санда веб технологиялары менен жана керектиги фреймворктар менен дестелеги менен жумшактуу</p>
       
       <p>• Иштеп чыгуу үчүн киргизилген дебаглаштыруу кире алат менен Git интеграциясы</p>
       
       <p>• Код толтуруу менен тандоо жана адаптациялоо кызматтары кире алат, көптөрдүү мүмкүндүлүктерге</p>
       
       <p>• Көптөр</p>
       
       <p>• Тегерек эмес, эки жүмүрт бир айга мүнөзү эмес</p>
       
       <p>• Тегерек эмес, чоң проекттер менен жана керектиги фреймворктар менен жумшактуу</p>
       
       <p>• Ал эмес, жана керектиги фреймворктар менен жана керек эмес</p>
       
       <p>WebStorm программасын электрондук вебсайттан жүктөп аласыз: <a href="https://www.jetbrains.com/webstorm/" target='_blank' > 👉🏼 WebStorm</a></p>
       
       <p>Баштапкычтар үчүн, <b>Notepad++ </b> колдонуучулар үчүн жакшы болуп табылады, чыгымдуу жана тез код редактору болуп, колдонууну көрүү кире алат. Бирок, ал өз аягында автоматтык-толуктуу же дебаглаштыруу кызматтары менен камтылыштууга маганы чоң кылабайт, бул жана начар баштоочулардын кодун жазып жөнөтүү үчүн колдонууну зоркоом кылат. Бирок, баштапкычтар үчүн, Notepad++ менен баштап, кызматкерлердин өзгөрүүлөрү же сүргүндөрүүлөрү боюнча текшерүүгө жана киргизүүгө аралаштыруучуларды жагымдуу редакторлорго жолулук кылат.</p>
       
       <p><b>Sublime Text</b> тез жана таанулуу код редактору, кичине жана чоң проекттер үчүн жакшы болуп табылады. Көптөрдүү курсордорду дестелеги менен жана көптөрдүү издөө жана орнотуу функциясы менен багытталат, аны тийиштүү убакытты жана иштеп чыгуучулукту көбөйтөт. Бирок, ал тегерек эмес жана башкаруу кызматтары менен көрүнбөйт, бул баштапкычтар үчүн жакшы эмес.</p>
       
       <p><b>Visual Studio Code</b> жакшы көптөр жана шакталган код редактору болуп, жакшы код редактору менен баштап, кийинки жакындыкты коюлгон колдонуучуларга өнүктүүнү көрсөтүү. Аны, бир нече программалаштыруу тили менен файл форматтарын дестелеги менен жумшактап, бир нече плагиндер менен жана көптөрдүү көрүнүштөр менен узарткан. Анын башкы өзү, тегерек эмес жана көптөр эмес, чоң проекттер менен же киргизмелер менен биргелештирилет, кыймылдарды башкаруу үчүн бүгүндөкү салам айырбасталат.</p>
       
       <p><b>Atom</b> эл ачык код редактору болуп, жаңы жана узартылаткан интерфейси бар. Аны көптөрдүү программалаштыруу тили менен файл форматтарын дестелеги менен жумшактап, көптөрдүү плагиндер менен жана пакеттер менен узарткан, кызматкерлер колдонууну уйгаштыруу менен жаңы кызматтар коюлгандыгын көрсөткөн. Бирок, ал тегерек эмес, чоң проекттер менен же көптөрдүү пакеттер менен көптөрдүү киргизмелер менен биргелештирилет, интерфейс көптөгөн кой болот, бул да иштеп чыгуучулукту көбөйтөт.</p>
              
       <p><b>WebStorm</b> вебдеги иштеп чыгуу үчүн жакшы киргизилген жана шакталган код редактору болуп, көптөрдүү веб технологиялары менен жана фреймворктар менен дестелеги менен жумшактуу. Аны, дебаглаштыруу үчүн киргизилген дебаглаштыруу кызматтары менен Git интеграциясы менен көптөрдүү кызматтарды көрсөтөт. Анын, код толтуруу менен тандоо жана адаптациялоо кызматтары, кыргызуучулардын кодун жазуу менен управлялуу үчүн көбөйтөт. Бирок, ал тегерек эмес жана ачык код редактору, жакындыкты киргизүүгө жана көптөрдүү технологиялар менен кыргызмелер менен биргелештирилет, кыймылдарды башкаруу үчүн көптөр эмес.</p>       
              
       <p>Жалпыда, <b>баштапкычтар үчүн</b>, Notepad++ баштоо үчүн жакшы жер, бирок, өз көзөмүздү көзө алып, башкаруу үчүн аралыкча көргөн код редакторлору Visual Studio Code же WebStorm, алардын кызматтары жана үлгүлөрү боюнча таандаган болушу мүмкүн.</p>       
       
       <h1>Ubuntu</h1>
       
       <p>Ubuntu болгон популярдуу Linux дистрибуциясы, андан өткөн убакты, ачык код болуп, жана колдонуу үчүн оңой жана көптөрдүү. Бул жаңы кыргызуучуларга өз кодун жазууучу менен баш тартуу үчүн күчтүүдүн бир көптүгүн табышынан кылынган. Ubuntu, күчтүүлөрдүн бир көптүгүн жөндөө үчүн көптөрдүү программалаштыруу тили менен жана программалар менен көмөк кылат.  </p>
       
       <p>Сонунан, Ubuntu көптөрдүү башкаруу жана колдонуу мүмкүнчүлүктөрү менен Windows же macOS топтун байланышынан бери көптөрдүү жана маансалык, жактаптыргыч, жана жактырылган агенттер менен улануу. Ал жардамды маалымат, оңой кызматтар менен, убакыты жана форумдордо көптөрдүү кыргызуучуларга көмөк кылышты алуу үчүн көптөрдүү коммуналдуу.</p>
       
       <p>Көптөрдүү, Linux колдонуу кыргызуучулар үчүн көптөрдүү жана кабардалган болуп табылады, бириккичликтик ачык коду менен ачык колдонууну көрсөтөт. Ал, абал-жардамдыктардын көбүнөн убактысын берет, кыргызуучулардын колдонуу аппликациялары менен иштейткен программалар менен иштөөчүлөрдүн баштапкычтык сапарларына.</p> 
       
       <p>Марк Шаттлуур, Каноникал компаниясынын баскычы жана Ubuntu аркылуу өз ишине жеңишкен кылынган болуп, улуну, Линус Торвалдс жана Linux коммунасынын түзүлүшү менен жаткан ишти. Linux Ubuntuдун кернели, жана Торвалдс менен Шаттлуурдун ачык коддорду жактаптыргыч башкаруу максаттары өзүнчө тааныштырып, Ubuntuду кыргызууушу мүмкүнчүлүктөрү менен эске салышкан. Эки мүнөт иштеп чыгуу кызматтарынын өнүштөрү менен келечегин көрсөтүүчү, жана бардыкча убактылуу технологияларга алым көрсөтүүчүлөрдүн идеяларын жактаптырган.</p>
              
        <p>Сиз Ubuntuду кыргызып калган болсоңуз, соңкы нүсгөсүн электрондук вебсайттан жүктөп аласыз: <a href="https://ubuntu.com/download/desktop" target='_blank' > 👉🏼  Ubuntu</a></p>      
       
       <h1>Git жана GitHub: Баштапкы концепциялар жана командалар үчүн </h1>
       
       <p> Git кодунуздун убакыты боюнча өзгөрүүлөрүн көзөмөйт, тиркемени көмөкчү болот. Бул сизге код базасынын эңбегин бир жакта иштеп чыгууңузга, өз код базасынын көчмөлүүлөрүн жасаңыз жана аларды сынаңыз кандайча башкалардын ишин алкагысыз. Git аны болбосо үчүн, бир жакта иштеп чыгууну жана кармаш убакытын башкалар менен улантылат, керек кылат жана өз эмес, үчүн жакындыкты киргизүүнү жана көзөмөйт жасаңыз.</p>
       
       <p>GitHub коду үчүн онлайн платформа, бул Git репозиторийлери үчүн хостинг көрсөтүп, коддо жумшактаптап иштей алат жакшылантырды. GitHub репозиторийлерди башкалар менен иштеп чыгуу үчүн вебдеги интерфейси бар, бул просто файлдардын жана файлдардын толтуруу историясы менен жумшакталган коллекциялар. GitHub колдонуучуларга жаңы репозиторийлер жасоо, алдын ала жеткен репозиторийлерди өзгөртүүлөргө жана башкалар менен көлөмдөшүүгө мүмкүнчүлүк берет.</p>
       
       <p>Git жана GitHub көргөнөн кызматкерлер үчүн, репозиторийлер, коммиттер, бранчдар, жана бирликтүү бөлүмдөр жана бир тамыр боюнча баштапкы көргөнөлүүлөрү билерди баштапкы концепциялар. Көптөрдүү онлайн кызматтар жана убакыт берүүлөр баскылаары менен баштапкы концепциялар үчүн чет эштөөлөр көрсөтөт.</p>
       
       <p>Бул бир катар баштапкы Git командалары:</p>
       
       <p> • git init: Жаңы Git репозиторийин инициализациялоо</p>
       
       <p> • git add: Өзгөртүүлөрдү стага коюу</p>
       
       <p>• git commit: Коммиттерди репозиторийга сактап</p>
       
       <p>• git status: Репозиторийдеги өзгөртүүлөрдүн статусун көрсөтөт</p>
       
       <p>• git log: Репозиторийдеги бардык коммиттерди көрсөтөт</p>
       
       <p>• git branch: Репозиторийдеги бардык бранчдарды көрсөтөт</p>
       
       <p>• git checkout: Бранчдарды же коммиттерди өзгөртүү</p>
       
       <p>• git merge: Бир бранчдан башкасына өзгөртүүлөрдү биргелештирүү</p>
       
       <p>Жана бул бир катар баштапкы GitHub командалары:</p>
       
       <p>• git clone: Репозиторийди GitHubтан жерги машинаңызга көчүрүү</p>
       
       <p>• git push: Жерги репозиторийдеги өзгөртүүлөрдү GitHubтага көчүрүү</p>
       
       <p>• git pull: GitHubтагы жерги репозиторийдеги өзгөртүүлөрдү жерги машинаңызга көчүрүү</p>
       
       <p>• git fetch: GitHubтагы жерги репозиторийдеги өзгөртүүлөрдү жерги репозиторийге жана биргелештирмеден көчүрүү</p>
       
       <b><p>* Текст котормочунун жардамы менен жазылган. Эгер ката тапсаңыз, бизге кабарлаңыз *</p></b>
    <div className='ads-container'>  
  {/*  реклама  */}
</div>
    </div>
  )
}

export default kyProgramming_tips;