import React from 'react';

function TjHtml_7() {
  return (
    <div>
      <div className='ad-container'>  
          {/*  реклама  */}
        </div>

           <h2>Фарқи байни HTML ва XML чист?</h2>

   <p>
     HTML (HyperText Markup Language) барои сохтани веб-саҳифаҳои сохторӣ, ки муайян мекунанд, истифода мешавад
     мундариҷаи саҳифа барои намоиш дар браузери веб. XML (забони eXtensible Markup Language) универсалӣ аст
     забони аломатгузорӣ барои нигоҳдорӣ ва интиқоли маълумот бидуни маҳдудият дар сохтор. Фарқи асосии байни HTML ва XML
     Ин аст, ки HTML барои намоиши мундариҷа аст, дар ҳоле ки XML барои нигоҳдорӣ ва интиқол аст
     маълумот бе истинод ба сохтори мушаххас.
   </p>

   <h2> Байни HTML ва XML чӣ монандиҳо мавҷуданд?</h2>

   <p>
     Ҳам HTML ва ҳам XML забонҳои аломатгузорӣ мебошанд, ки тегҳоро барои муайян кардани сохтори додаҳо истифода мебаранд.
     Ҳарду метавонанд аз ҷониби таҳлилгарон коркард карда шаванд ва барои намоиш додани маълумот шарҳ дода шаванд, гарчанде ки истифодаи онҳо
     ва мақсад гуногун аст.
   </p>

<h2>Синтаксис</h2>

   <p>
     Синтаксиси HTML ва XML аз он иборат аст, ки ҳарду барои муайян кардани сохтори ҳуҷҷат тегҳоро истифода мебаранд.
     Дар HTML, бисёр элементҳо тегҳои пешакӣ муайяншуда доранд, дар ҳоле ки XML ба шумо имкон медиҳад тегҳои шахсии худро муайян кунед.
     Тегҳои HTML метавонанд бо ҳарфҳои калон, хурд ё омезиши ҳарду навишта шаванд, дар ҳоле ки барчаспҳои XML ҳассос мебошанд.
  </p>

  <h2>Истифода</h2>

  <p>
     HTML барои сохтани саҳифаҳои веб истифода мешавад, дар ҳоле ки XML барои нигоҳдорӣ ва интиқоли маълумот васеъ истифода мешавад.
     ба монанди файлҳои конфигуратсия, маълумоти маҳсулот ва ғайра.
</p>

<h2>Тафовутҳои асосии синтаксиси байни HTML ва XML</h2>

   <p>
     Фарқиятҳои асосии синтаксисӣ дар он аст, ки HTML дорои тегҳо ва сохторҳои пешакӣ муайяншуда мебошад,
     дар ҳоле ки XML ба шумо имкон медиҳад тегҳо ва сохторҳои шахсии худро муайян кунед. Илова бар ин, HTML аксар вақт атрибутҳоро дар бар мегирад
     ки тегҳоро ба монанди href дар {'<a>'} барои истинодҳо мукаммал мекунанд, дар ҳоле ки XML тегҳоро бе атрибутҳо истифода мебарад
     барои муайян кардани сохтори маълумот.
  </p>

  <h2>Тегҳои пешакӣ муайяншуда</h2>

   <p>
     HTML дорои бисёр тегҳои пешакӣ муайяншуда ба монанди {'<h1>, <p>, <a>, <div>,'}, ки қисмҳои гуногуни саҳифаи вебро муайян мекунанд.
     XML тегҳои пешакӣ муайяншуда надорад ва аз эҷоди тегҳои фармоишӣ мувофиқи сохтори додаҳои зарурӣ вобаста аст.
   </p>
 

   <h2> Намунаҳои HTML ва XML</h2>

<code>
<pre>
    {`
    <!-- Пример HTML -->
    <!DOCTYPE html>
    <html>
    <head>
        <title>Намунаи HTML</title>
    </head>
    <body>
        <h1>Заголовок</h1>
        <p>Параграф бо <a href="https://example.com">пайванд</a>.</p>
    </body>
    </html>
   
   
    <?xml version="1.0" encoding="UTF-8"?>
<note>
    <to>Қабулкунанда</to>
    <from>Ирсолкунанда</from>
    <heading>Сарлавҳа</heading>
    <body>Матнро қайд кунед.</body>
</note>
`}
</pre>
</code>

{/* Самозакрывающиеся теги */}

<h2>Тегҳои худпўшанда</h2>

  <p>
     HTML баъзан тегҳои худпўшшавандаро истифода мебарад, ба монанди {'<img> ё <br>'}, дар ҳоле ки дар XML ҳар як тег
     бояд ба таври ошкоро баста ё худпўшанда бошад.
  </p>

{/* Другие ключевые отличия HTML и XML */}

<h2>Дигар фарқиятҳои калидӣ байни HTML ва XML </ h2>

   <p>
     HTML барои муаррифии мундариҷаи саҳифаи веб тарҳрезӣ шудааст, дар ҳоле ки XML барои нигоҳдорӣ ва интиқоли маълумот истифода мешавад.
     HTML дорои бисёр унсурҳо ва атрибутҳои пешакӣ муайяншуда мебошад, дар ҳоле ки XML таърифи возеҳро талаб мекунад
     элементҳо ва атрибутҳо.
  </p>
{/* Когда использовать HTML и XML */}

<h2> Кай истифода бурдани HTML ва XML</h2>

  <p>
     HTML-ро барои сохтани саҳифаҳои веб бо мундариҷае, ки бояд дар браузер намоиш дода шаванд, истифода баред.
     Барои сохтор ва нигоҳ доштани маълумоте, ки ҳатман дар саҳифаи веб пайдо намешаванд, XML-ро истифода баред.
  </p>
{/* Как использовать HTML и XML вместе */}

<h2>Чӣ тавр HTML ва XML-ро якҷоя истифода бурдан мумкин аст</h2>

  <p>
     HTML ва XML метавонанд якҷоя истифода шаванд, масалан, барои сохтани саҳифаҳои веб, ки маълумотро аз файлҳои XML барои намоиш бор мекунанд.
     Барои ин мақсад аксар вақт технологияҳо ба монанди AJAX ё забонҳои барномасозии сервер истифода мешаванд.
  </p>
{/* Краткое изложение основных различий между HTML и XML */}

<h2>Хулосаи фарқиятҳои асосии байни HTML ва XML</h2>

   <p>
     HTML барои сохтани саҳифаҳои веб аст ва дорои барчаспҳои пешакӣ муайяншуда, дар ҳоле ки XML барои он истифода мешавад
     нигоҳдорӣ ва интиқоли маълумоти сохторӣ ва ба шумо имкон медиҳад тегҳо ва атрибутҳои фармоиширо муайян кунед.
  </p>
{/* Как начать работать с XML */}

<h2>Чӣ тавр бо XML оғоз кардан мумкин аст</h2>

   <p>
     Барои кор бо XML ба шумо муҳаррири матн ва дониши синтаксиси асосӣ лозим аст.
     Шумо метавонед бо омӯхтани сохтори ҳуҷҷатҳои XML, унсурҳо ва атрибутҳои асосии онҳо,
     ва усулҳои коркарди маълумоти XML бо истифода аз китобхонаҳо ё асбобҳо дар забони барномасозии шумо.
   </p>

{/* Как начать работать с HTML */}

<h2>Чӣ тавр бо HTML оғоз кардан мумкин аст</h2>

   <p>
     Барои оғози кор бо HTML, шумо инчунин ба муҳаррири матнӣ ва баъзе донишҳои ибтидоии аломатгузорӣ ниёз доред.
     Шумо метавонед барчаспҳои асосии HTML, атрибутҳои онҳо ва сохтори саҳифаи вебро омӯзед,
     ва услуб ва усулҳои интерактивӣ бо истифода аз CSS ва JavaScript.
   </p>

   <b><p>* Матн бо ёрии тарчумон навишта шудааст. Агар шумо хатое пайдо кунед, лутфан ба мо хабар диҳед *</p></b>
    
    <div className='ads-container'>  
  {/*  реклама  */}
</div>
    </div>
  )
}

export default TjHtml_7;