import React from 'react';

function TjReact_1() {
  return (
    <div>
      <div className='ad-container'>  
          {/*  реклама  */}
        </div>
        
       <h1>React JS</h1>

<p><b>ReactJS</b> як китобхонаи маъмули <b>JavaScript </b> мебошад, ки аз ҷониби <b>Facebook</b> сохта шудааст. Он бори аввал соли 2013 бароварда шуд ва аз он вақт инҷониб дар байни таҳиягарони веб пайравони зиёд пайдо кард.</p>

<p>ReactJS барои ҳалли як масъалаи мушаххас сохта шудааст - зарурати роҳи зуд ва муассир сохтани интерфейсҳои мураккаби корбар бо миқдори зиёди додаҳо, ки бо мурури замон тағйир меёбанд. Қабл аз ReactJS сохтани ин намуди интерфейсҳо коди зиёдро талаб мекард ва идора кардан одатан суст ва душвор буд.</p>

<p>Идеяи асосии ReactJS тақсим кардани интерфейсҳои корбар ба ҷузъҳои инфиродӣ мебошад, ки метавонанд дар қисмҳои гуногуни барнома дубора истифода шаванд. Ҳар як ҷузъ барои намоиш додани як порчаи хурди UI масъул аст ва онҳоро барои эҷоди интерфейсҳои мураккаб ба осонӣ якҷоя кардан мумкин аст.</p>

<p>Яке аз бартариҳои асосии ReactJS дар он аст, ки он DOM-и виртуалиро истифода мебарад, ки муаррифии сабуки DOM воқеист. Ин ба ReactJS имкон медиҳад, ки UI-ро ба таври хеле муассир бидуни навсозии гаронарзиш ба DOM воқеии навсозӣ кунад.</p>

<p><b>Ин ҷо як мисоли ҷузъҳои оддии ReactJS:</b></p>

<code>
  <p><span className='red'>import </span>React  <span className='red'>from</span> <span className='blue'>'react'</span>;</p>

  <p><span className='red'>function</span> <span className='blueviole'>MyComponent</span>(props) {'{'}</p>

  <p><span className='red'>return</span> {'('}</p>

  <p>{'<'}<span className='green'>div</span>{'>'}</p>

  <p>&nbsp;{'<'}<span className='green'>h1</span>{'>'}{'{'}props.<span className='blue'>title{'}'}</span>{'</'}<span className='green'>h1</span>{'>'}</p>

  <p>&nbsp;{'<'}<span className='green'>p</span>{'>'} {'{'}props.<span className='blue'>description</span>{'}'}{'<'}<span className='green'>/p</span>{'>'}</p>

  <p>{'</'}<span className='green'>div</span>{'>'}</p>

  <p>&nbsp;{');'}</p>

  <p>{'}'}</p>

  <p><span className='red'>export default</span> MyComponent;</p>  
</code>
<p>Ин ҷузъ ду реквизитро дар бар мегирад - <b>унвон ва тавсиф </b>- ва онҳоро дар сохтори оддии HTML намоиш медиҳад. Пас аз он ин ҷузъро дар тамоми барнома барои намоиш додани маълумот ба корбар истифода бурдан мумкин аст.</p>

<p>Агар шумо ба маълумоти бештар дар бораи ReactJS таваҷҷӯҳ дошта бошед, ман тавсия медиҳам, ки аз ҳуҷҷатҳои расмии вебсайти ReactJS оғоз кунед: <a href="https://react.dev/" target='_blank' > 👉🏼 < b>https://react.dev/</b> </a>. Дар он ҷо шумо маълумоти зиёдеро дар бораи чӣ гуна оғоз кардан бо ReactJS, аз ҷумла дарсҳо, дастурҳо ва маводҳои истинод пайдо хоҳед кард.</p>

<p>Барои насб кардани Node.js барои кор бо React, амалҳои зеринро иҷро кунед:</p>

<h1>Насб кардани Node.js дар Windows</h1>

<p>1. Ба вебсайти расмии Node.js равед:<a href="https://nodejs.org/" target='_blank' > 👉🏼 https://nodejs.org/ </a></p>

<p>2. Барои версияи "Windows Installer" тугмаи "Зеркашӣ" -ро клик кунед</p>

<p>3. Насбкунандаи зеркашидаро иҷро кунед ва дастурҳоро барои насб кардани Node.js</p> иҷро кунед

<p>4. Пас аз ба итмом расидани насб, сатри фармонро кушоед ва node -v-ро ворид кунед, то боварӣ ҳосил кунед, ки Node.js дуруст насб шудааст</p>
<h1>Насб кардани Node.js дар Ubuntu</h1>

<p>1. Равзанаи терминалро кушоед</p>

<p>2. Фармони <b>sudo apt update барои навсозӣ</b> мудири баста</p>-ро иҷро кунед

<p>3. Фармони <b>sudo apt install nodejs</b> -ро барои насб кардани Node.js</p> иҷро кунед.

<p>4. Фармони <b>node -v</b> -ро иҷро кунед, то боварӣ ҳосил кунед, ки Node.js дуруст насб шудааст</p>

<b>Ин ҷо як мисоли истифодаи якҷояи Node.js ва React:</b>

<p>1. Бо истифода аз фармони <b>npx create-react-app my-app</b></p> як барномаи нави React эҷод кунед

<p>2. Бо истифода аз фармони <b>cd my-app</b></p> ба феҳристи <b>my-app</b> тағир диҳед

<p>3. Сервери таҳияро бо истифода аз фармони <b>npm start</b></p> оғоз кунед

<p>4. Браузери вебро кушоед ва ба <b>http://localhost:3000</b> гузаред, то бубинед, ки барномаи React кор мекунад</p>
    
  <p>Агар шумо ба маълумоти бештар дар бораи Node.js ва React таваҷҷӯҳ дошта бошед, ман тавсия медиҳам, ки ҳуҷҷатҳои расмии ҳарду технологияро тафтиш кунед. Инҳо истинодҳо ба вебсайтҳои дахлдори онҳо ҳастанд:</p>
    
  <p><b><a href="https://nodejs.org/" target='_blank' > 👉🏼 Node.js</a></b></p>

  <p><b> <a href="https://react.dev/" target='_blank' > 👉🏼 React.js</a></b> </p>

  <p><b>Барои кор бо React, шумо бояд чизҳои зеринро хуб фаҳмед:</b></p>

  <p>1. <span className='chocolate'>HTML</span>/<span className='blue'>CSS</span>: Шумо бояд HTML ва CSS-ро хуб фаҳмед, зеро React асосан барои сохтани интерфейсҳои корбар (UI) истифода мешавад. ) ва барномаҳои веб.</p>

  <p>2. <span className='yellow'>JavaScript</span>: React китобхонаи JavaScript аст, аз ин рӯ ба шумо лозим меояд, ки фаҳмиши хуби JavaScript, аз ҷумла мафҳумҳо ба монанди функсияҳо, массивҳо, объектҳо ва миқёсро дошта бошед.</p>

  <p>3. <span className='red'>ES6</span>: React асосан ба хусусиятҳои ES6, аз қабили функсияҳои тир, вайронкунӣ ва синфҳо такя мекунад, аз ин рӯ ба шумо лозим меояд, ки ин хусусиятҳоро хуб фаҳмед.</p>

  <p>4. <span className='blueviole'>JSX</span>: Тавре ки қаблан зикр гардид, JSX як васеъшавии синтаксиси JavaScript мебошад, ки ба шумо имкон медиҳад, ки дар файлҳои JavaScript коди ба HTML монандро нависед. Шумо бояд фаҳмед, ки JSX чӣ гуна кор мекунад ва чӣ гуна онро барои муайян кардани ҷузъҳои UI истифода бурдан мумкин аст.</p>

  <p>5. <span className='green'>Node.js</span> ва <span className='red'>npm</span>: Барномаҳои вокуниш одатан бо истифода аз Node.js ва мудири бастаи npm сохта мешаванд. Шумо бояд фаҳмед, ки чӣ тавр насб кардан ва истифода бурдани ин асбобҳо.</p>

  <p>6. Экосистемаи <span className='blue'>React</span>: Доираи васеи абзорҳо ва китобхонаҳое мавҷуданд, ки маъмулан дар экосистемаи React истифода мешаванд, ба монанди React Router, Redux ва Axios. Шумо бояд фаҳмед, ки ин асбобҳо чӣ гуна кор мекунанд ва чӣ гуна онҳоро барои сохтани барномаҳои React истифода бурдан мумкин аст.</p>

  <p>7. <span className='dev-tools'>Асбобҳои таҳия</span>: Шумо инчунин бояд бо асбобҳои таҳия, аз қабили Visual Studio Code, Chrome DevTools ва Git шинос шавед.</p>
  
  <b><p>* Матн бо ёрии тарчумон навишта шудааст. Агар шумо хатое пайдо кунед, лутфан ба мо хабар диҳед *</p></b>
    
    <div className='ads-container'>  
  {/*  реклама  */}
</div>
    </div>
  )
}

export default TjReact_1;