import React from 'react';

function TjReact_10() {
  return (
    <div>
      <div className='ad-container'>  
          {/*  реклама  */}
        </div>

      <h2>Хатоҳои HTTP</h2>
   
   {/* Informational responses (100 – 199) */}
   
   <h3>Ҷавобҳои иттилоотӣ (100 – 199) </h3>
      <p>
        <strong>100 Continue:</strong> Сервер сарлавҳаҳои дархостро гирифтааст ва муштарӣ бояд ба фиристодани мақоми дархост идома диҳад (дар ҳолати дархосте, ки барои он бадан бояд фиристода шавад; масалан, дархости POST) .
      </p>
      <p>
        <strong>101 Switching Protocols:</strong> Дархосткунанда аз сервер хоҳиш кардааст, ки протоколҳоро иваз кунад ва сервер ба ин розӣ шуд.
      </p>
      <p>
        <strong>102 Processing:</strong> Сервер дархостро қабул кард ва коркард мекунад, аммо то ҳол посухе дастрас нест.
      </p>
      <p>
        <strong>103 Early Hints:</strong> Ба муштарӣ ишора мекунад, ки сервер эҳтимолан посухи ниҳоиро бо майдонҳои сарлавҳаи дар посухи иттилоотӣ дохилшуда ирсол кунад.
      </p>
    

   {/* Successful responses (200 – 299) */}
    
   <h3>Ҷавобҳои муваффақ (200 – 299) </h3>
      <p>
        <strong>200 OK:</strong> Дархост иҷро шуд. Маълумоте, ки бо ҷавоб бармегардад, аз усули дар дархост истифодашуда вобаста аст.
      </p>
      <p>
        <strong>201 Created:</strong> Дархост иҷро шуд, ки дар натиҷа манбаи нав эҷод шуд.
      </p>
      <p>
        <strong>202 Accepted:</strong> Дархост барои коркард қабул карда шуд, аммо коркард анҷом наёфтааст.
      </p>
      <p>
        <strong>203 Non-Authoritative Information:</strong> Сервер дархостро бомуваффақият коркард кард, аммо маълумотеро бармегардонад, ки шояд аз манбаи дигар бошад.
      </p>
      <p>
        <strong>204 No Content:</strong> Сервер дархостро бомуваффақият коркард кард ва ягон мундариҷаро барнамегардонад.
      </p>
      <p>
        <strong>205 Reset Content:</strong> Сервер дархостро бомуваффақият коркард кард, аммо ягон мундариҷаро барнамегардонад. Мизоҷ бояд намуди ҳуҷҷатро аз нав барқарор кунад.
      </p>
      <p>
        <strong>206 Partial Content:</strong> Сервер танҳо як қисми захираро аз сабаби сарлавҳаи диапазон аз ҷониби муштарӣ фиристодааст.
      </p>
      <p>
        <strong>207 Multi-Status:</strong> Ҷавоби Мулти-мақом маълумотро дар бораи захираҳои сершумор дар ҳолатҳое интиқол медиҳад, ки рамзҳои вазъ метавонанд мувофиқ бошанд.
      </p>
    

   {/* Redirection messages (300 – 399) */}
   
   <h3>Паёмҳои масир (300 – 399) </h3>
      <p>
        <strong>300 Multiple Choices:</strong> Манбаи дархостшуда дорои интихоби сершумор мебошад, ки ҳар кадоми онҳо атрибутҳо ва ҷавобҳои гуногун доранд.
      </p>
      <p>
        <strong>301 Moved Permanently:</strong> Манбаи дархостшуда ба таври доимӣ ба URL-и нав интиқол дода шуд ва ҳама гуна истинодҳои оянда ба ин манбаъ бояд яке аз URL-ҳои баргардонидашударо истифода баранд.
      </p>
      <p>
        <strong>302 Found:</strong> Манбаи дархостшуда муваққатан зери URI-и дигар ҷойгир аст.
      </p>
      <p>
        <strong>303 See Other:</strong> Ҷавоб ба дархостро дар зери URI-и дигар пайдо кардан мумкин аст ва он бояд бо истифода аз усули GET дар ин манбаъ гирифта шавад.
      </p>
      <p>
        <strong>304 Not Modified:</strong> Нишон медиҳад, ки манбаъ аз версияи муайянкардаи сарлавҳаҳои дархост If-Modified-Since ё If-None-Match тағир дода нашудааст. Дар ин ҳолат, зарурати интиқоли дубораи манба вуҷуд надорад, зеро муштарӣ нусхаи қаблан зеркашидашударо дорад.
      </p>
      <p>
        <strong>305 Use Proxy:</strong> Ба манбаи дархостшуда бояд тавассути проксие, ки дар майдони Ҷойгир дода шудааст, дастрас карда шавад.
      </p>
      <p>
        <strong>307 Temporary Redirect:</strong> Манбаи дархостшуда муваққатан зери URI-и дигар ҷойгир аст.
      </p>
      <p>
        <strong>308 Permanent Redirect:</strong> Манбаи дархостшуда ба таври доимӣ ба URI-и дигар интиқол дода шудааст ва муштарӣ бояд ҳамаи истинодҳоро ба ин URI нав навсозӣ кунад.
      </p>
    

   {/* Client error responses (400 – 499) */}
    
   <h3>Ҷавобҳои хатогии муштарӣ (400 – 499) </h3>
      <p>
        <strong>400 Bad Request:</strong> Сервер наметавонад дархостро бо сабаби хатои муштарӣ коркард кунад (масалан, синтаксиси нодуруст, андозаи аз ҳад калон, чаҳорчӯбаи паёми дархости нодуруст ё масири дархости фиребанда).
      </p>
      <p>
        <strong>401 Unauthorized:</strong> Монанди 403 Манъ, аммо махсусан барои истифода, вақте ки аутентификатсия талаб карда мешавад ва ноком шудааст ё ҳанӯз таъмин нашудааст.
      </p>
      <p>
        <strong>402 Payment Required:</strong> Барои истифодаи оянда маҳфуз аст.
      </p>
      <p>
        <strong>403 Forbidden:</strong> Муштарӣ иҷозати дастрасӣ ба манбаи дархостшударо надорад.
      </p>
      <p>
        <strong>404 Not Found:</strong> Сервер манбаи дархостшударо пайдо карда наметавонад.
      </p>
      <p>
        <strong>405 Method Not Allowed:</strong> Усули дар сатри дархост гирифташуда аз ҷониби сервери аслӣ маълум аст, аммо аз ҷониби манбаи мақсаднок дастгирӣ намешавад.
      </p>
      <p>
        <strong>406 Not Acceptable:</strong> Манбаи мақсаднок намояндагии ҷорӣ надорад, ки мувофиқи майдонҳои сарлавҳаи музокира, ки дар дархост гирифта шудааст, барои агенти корбар қобили қабул бошад.
      </p>
      <p>
        <strong>407 Proxy Authentication Required:</strong> Муштарӣ бояд аввал худро бо прокси тасдиқ кунад.
      </p>
      <p>
        <strong>408 Request Timeout:</strong> Муштарӣ дар давоми вақте, ки сервер барои интизор шудан омода буд, дархост пешниҳод накард.
      </p>
      <p>
        <strong>409 Conflict:</strong> Дархост бо сабаби ихтилоф бо ҳолати кунунии манбаи мақсаднок анҷом дода нашуд.
      </p>
      <p>
        <strong>410 Gone:</strong> Нишон медиҳад, ки манбаи мақсаднок дигар дар сервер дастрас нест ва суроғаи интиқол маълум нест.
      </p>
      <p>
        <strong>411 Length Required:</strong> Сервер қабули дархостро бе дарозии муайяншудаи мундариҷа рад мекунад.
      </p>
      <p>
        <strong>412 Precondition Failed:</strong> Як ё якчанд шартҳо, ки дар майдонҳои сарлавҳаи дархост дода шудаанд, ҳангоми санҷиш дар сервер нодуруст арзёбӣ шудаанд.
      </p>
      <p>
        <strong>413 Payload Too Large:</strong> Сервер коркарди дархостро рад мекунад, зеро сарбории дархост аз он ки сервер омода ё қодир аст коркард кунад, калонтар аст.
      </p>
      <p>
        <strong>414 URI Too Long:</strong> Сервер аз хидматрасонии дархост худдорӣ мекунад, зеро ҳадафи дархост аз он ки сервер мехоҳад тафсир кунад, дарозтар аст.
      </p>
      <p>
        <strong>415 Unsupported Media Type:</strong> Сервери аслӣ аз хидматрасонии дархост худдорӣ мекунад, зеро формати боркунии боркунӣ дар формати дастгирӣнашаванда аст.
      </p>
      <p>
        <strong>416 Range Not Satisfiable:</strong> Муштарӣ як қисми файлро (хизмати байт) дархост кардааст, аммо сервер ин қисмро таъмин карда наметавонад.
      </p>
      <p>
        <strong>417 Expectation Failed:</strong> Сервер наметавонад ба талаботи майдони Сарлавҳаи дархости интизорӣ ҷавобгӯ бошад.
      </p>
      <p>
        <strong>418 I'm a teapot:</strong> Ҳар як кӯшиши пухтани қаҳва бо чойник бояд ба коди хатогӣ оварда расонад "418 Ман чойник ҳастам".
      </p>
      <p>
        <strong>420 Enhance Your Calm:</strong> Аз ҷониби API Ҷустуҷӯ ва Trends Twitter бармегардад, вақте ки мизоҷ бо суръати маҳдуд аст.
      </p>
      <p>
        <strong>421 Misdirected Request:</strong> Дархост ба сервере равона карда шудааст, ки қодир нест ҷавоб диҳад.
      </p>
      <p>
        <strong>422 Unprocessable Entity:</strong> Дархост хуб таҳия шуда буд, аммо бинобар хатогиҳои семантикӣ иҷро карда нашуд.
      </p>
      <p>
        <strong>423 Locked:</strong> Манбае, ки дастрас мешавад, баста аст.
      </p>
      <p>
        <strong>425 Too Early:</strong> Нишон медиҳад, ки сервер намехоҳад дар хатари коркарди дархосте, ки метавонад такрор шавад.
      </p>
      <p>
        <strong>426 Upgrade Required:</strong> Сервер иҷрои дархостро бо истифода аз протоколи ҷорӣ рад мекунад, аммо метавонад пас аз навсозии муштарӣ ба протоколи дигар омода бошад.
      </p>
      <p>
        <strong>428 Precondition Required:</strong> Сервери аслӣ талаб мекунад, ки дархост шарт бошад.
      </p>
      <p>
        <strong>429 Too Many Requests:</strong> Корбар дар муддати муайян дархостҳои аз ҳад зиёд фиристодааст.
      </p>

   {/* Server error responses (500 – 599) */}
    
   <h3>Ҷавобҳои хатогии сервер (500 – 599) </h3>
      <p>
        <strong>500 Internal Server Error:</strong> Паёми хатогии умумӣ, ки ҳангоми дучор шудан ба ҳолати ғайричашмдошт дода мешавад ва ягон паёми мушаххас мувофиқ нест. Ин як хатои хеле умумӣ аст, ки метавонад аз доираи васеи мушкилот дар тарафи сервер ба вуҷуд ояд.
      </p>
      <p>
        <strong>501 Not Implemented:</strong> Сервер ё усули дархостро эътироф намекунад ё қобилияти иҷрои дархостро надорад.
      </p>
      <p>
        <strong>502 Bad Gateway:</strong> Сервер дар ҳоле ки ҳамчун шлюз ё прокси амал мекунад, аз сервери болооб, ки ҳангоми кӯшиши иҷрои дархост дастрасӣ дошт, ҷавоби нодуруст гирифт.
      </p>
      <p>
        <strong>503 Service Unavailable:</strong> Сервер дар айни замон бо сабаби сарбории муваққатӣ ё нигоҳдории сервер наметавонад дархостро иҷро кунад.
      </p>
      <p>
        <strong>504 Gateway Timeout:</strong> Сервер, дар ҳоле ки ҳамчун дарвоза ё прокси амал мекунад, аз сервери болооб, ки аз ҷониби URI ё ягон сервери ёрирасоне, ки барои ба анҷом расонидани дархост.
      </p>
      <p>
        <strong>505 HTTP Version Not Supported:</strong> Сервер версияи асосии HTTP-ро, ки дар паёми дархост истифода шудааст, дастгирӣ намекунад ё рад мекунад.
      </p>
      <p>
        <strong>506 Variant Also Negotiates:</strong> Сервер хатои конфигуратсияи дохилӣ дорад: манбаи варианти интихобшуда барои иштирок дар гуфтушуниди шаффофи мундариҷа танзим карда шудааст ва аз ин рӯ нуқтаи ниҳоии мувофиқ дар раванди гуфтушунид нест.
      </p>
      <p>
        <strong>507 Insufficient Storage:</strong> Сервер қодир нест, ки намояндагии лозимиро барои анҷом додани дархост нигоҳ дорад.
      </p>
      <p>
        <strong>508 Loop Detected:</strong> Сервер ҳангоми коркарди дархост як ҳалқаи беохирро ошкор кард.
      </p>
      <p>
        <strong>510 Not Extended:</strong> Барои иҷро кардани он сервер васеъкунии минбаъдаи дархост лозим аст.
      </p>
      <p>
        <strong>511 Network Authentication Required:</strong> Барои дастрас кардани дастрасӣ ба шабака муштарӣ бояд аутентификатсия кунад.
      </p>

      <b><p>* Матн бо ёрии тарчумон навишта шудааст. Агар шумо хатое пайдо кунед, лутфан ба мо хабар диҳед *</p></b>
    
    <div className='ads-container'>  
  {/*  реклама  */}
</div>
    </div>
  )
}

export default TjReact_10;