import React from 'react';

function TjTechTitans() {
  return (
    <div>
      <div className='ad-container'>  
          {/*  реклама  */}
        </div>
        
        <h1 className="heading">Барномасозони барҷастае, ки ҷаҳонро тағир доданд</h1>
  
  <ul className="programmers-list">
     <li className="programmer">
         <strong>Линус Торвалдс:&nbsp;&nbsp;</strong> Барномасози финландӣ, 28 декабри соли 1969 дар Ҳелсинки таваллуд шудааст. Вай ба шарофати дастоварди асосии худ - эҷоди ядрои системаи амалиётии Linux яке аз муҳимтарин ва бонуфузтарин таҳиягарони ҷаҳони нармафзори кушодаасос гардид.
                    
         <p>Таърихи Linux соли 1991 аз он оғоз шуд, ки Торвалдс ҳангоми донишҷӯи Донишгоҳи Ҳелсинки дар лоиҳаи системаи оператсионии худ ба кор шурӯъ кард. Вай мехост, ки алтернативаи ройгонро ба системаҳои тиҷории Unix монанд, ба монанди MINIX эҷод кунад. Дар давоми чанд моҳ ӯ версияи аввалини ядрои Linux-ро, ки барои истифодаи шахсӣ пешбинӣ шуда буд, офарид.</p>
                    
         <p>Бо гузашти вақт, Linux дар соҳаҳои гуногун, аз ҷумла системаҳои серверӣ ва дохилӣ маъмул шуд ва ба яке аз системаҳои оператсионии васеъ истифодашаванда дар ҷаҳон табдил ёфт. Табиати кушодаасос ва принсипҳое, ки Linux ба он асос ёфтааст, тавассути саҳми ҳазорон таҳиягарон дар саросари ҷаҳон ба рушд ва рушди он мусоидат кард.</p>
                    
         <p>Торвалдс иштироки фаъолонаро дар таҳия ва нигоҳдории ядрои Linux идома дода, фалсафаи нармафзори озод ва кушодаасосро дастгирӣ мекунад. Саҳми ӯро дар рушди системаҳои оператсионӣ ва технологияҳои барномасозӣ аз ҳад зиёд арзёбӣ кардан мумкин нест.</p>
     </li>

    <li className="programmer">
       <strong>Тим Бернерс-Ли:&nbsp;&nbsp;</strong> Олими компютерии бритониёӣ, 8 июни соли 1955 дар Лондон таваллуд шудааст. Вай ихтироъкори шабакаи ҷаҳонии интернет шуд ва ӯро ба яке аз шахсиятҳои муҳим ва бонуфуз дар таърихи технологияҳои иттилоотӣ табдил дод.
                    
       <p>Дар соли 1989 Бернерс-Ли аввалин консепсияи вебро таҳия ва муаррифӣ кард, ки системаи ҳуҷҷатҳои гиперматниро дар бар мегирад, ки бо гиперҳавола ба ҳам пайвастанд. Ӯ HTTP (Протоколи интиқоли гиперматн) ва HTML (Забони гиперматнӣ), технологияҳои бунёдии вебро офаридааст.</p>
                    
       <p>Баъд аз таъсиси веб, Тим Бернерс-Ли иштироки фаъолонаро дар таҳияи стандартҳои веб идома дод ва дар таъсиси Консорсиуми Ҷаҳонии Веб (W3C), ки ҳадафи он таҳия ва дастгирии маҷмӯи ягона мебошад, иштирок кард. стандартҳои шабакаи ҷаҳонии Интернет.</p>
                    
       <p>Барои дастовардҳои худ дар технологияҳои иттилоотӣ, Тим Бернерс-Ли соҳиби ҷоизаҳо ва мукофотҳои сершумор, аз ҷумла ордени Империяи Бритониё ва Ҷоизаи Нобел дар соҳаи компютер шудааст.</p>
     </li>

     <li className="programmer">
       <strong>Алан Тюринг:&nbsp;&nbsp;</strong> Математик ва криптографи бритониёӣ, 23 июни соли 1912 дар Лондон таваллуд шудааст. Вай яке аз бузургтарин ақли асри 20 шуд ва дар рушди компютерҳо ва информатика саҳми бузург гузошт.
                    
       <p>Асари Алан Тюринг ба соҳаҳои гуногуни илм, аз ҷумла мантиқ, информатика, зеҳни сунъӣ ва криптография таъсири амиқ гузошт. Саҳми машҳури ӯ таҳияи консепсияи мошини Тюринг мебошад, ки асоси компютерҳо ва барномасозии муосир гардид.</p>
                    
       <p>Дар давоми Ҷанги Дуюми Ҷаҳонӣ, Алан Тюринг дар кушодани шифри "Enigma", ки аз ҷониби фашистон истифода мешуд, нақши калидӣ бозид. Кори ӯ дар криптография ва шикастани кодҳо ба натиҷаи ҷанг таъсири ҳалкунанда расонд.</p>
                    
       <p>Баъд аз ҷанг, Тюринг таҳқиқоти худро дар соҳаи компютерҳо ва зеҳни сунъӣ идома дод. Вай дар назарияи ҳисоббарорӣ саҳми муҳим гузошт ва ғояҳои аввалинро дар бораи зеҳни сунъӣ таҳия кард, аз ҷумла "Тести Тюринг" барои муайян кардани қобилиятҳои зеҳнии мошин.</p>
                    
       <p>Барои дастовардҳои худ дар соҳаи илм, Алан Тюринг бо мукофотҳои сершумори бонуфуз ва ифтихорномаҳо сарфароз гаштааст ва кори ӯ ҳамчунон илҳом бахшидан ва ба рушди технологияҳои муосир таъсир мерасонад.</p>
     </li>

     <li className="programmer">
         <strong>Грейс Хоппер:&nbsp;&nbsp;</strong> Олим ва барномасози амрикоӣ, 9 декабри соли 1906 дар шаҳри Ню-Йорк таваллуд шудааст. Вай яке аз шахсиятҳои муҳим ва бонуфуз дар таърихи технологияҳои компютерӣ ва инчунин пешрав дар соҳаи барномасозӣ буд.
                    
         <p>Грэйс Хоппер бо саҳми назаррасаш дар рушди забонҳои компютерӣ ва компиляторҳо машҳур аст. Вай аввалин компиляторро барои забони барномасозии A-0 таҳия кард, ки қадами аввалин дар роҳи эҷоди забонҳои барномасозии сатҳи баланд буд.</p>
                    
         <p>Кори вай дар компиляторҳо боиси эҷоди забони барномасозии COBOL (Забони умумӣ ба тиҷорат нигаронидашуда) гардид, ки яке аз забонҳои барномасозии васеъ истифодашаванда дар бахши тиҷорат гардид. COBOL ба рушди бонкдорӣ, ҳисобдорӣ ва дигар бахшҳои тиҷорат таъсири калон расонд.</p>
                    
         <p> Илова ба кори худ дар барномасозӣ, Грейс Хоппер инчунин афсари низомӣ буд ва дар таҳияи компютерҳои электронии барвақт, аз қабили Ҳарвард Марк I ва UNIVAC ширкат дошт. Саҳми ӯро дар соҳаи технологияҳои иттилоотӣ зиёд арзёбӣ кардан мумкин нест ва ӯ барои бисёре аз занон дар соҳаҳои илм ва технология илҳомбахш боқӣ мемонад.</p>
     </li>

     <li className="programmer">
         <strong>Ада Лавлейс:&nbsp;&nbsp;</strong> Математики бритониёӣ ва пешвои илми информатика, 10 декабри соли 1815 дар Лондон таваллуд шудааст. Вай аксар вақт аввалин барномасоз дар таърих ҳисобида мешавад, ба шарофати кораш дар муҳаррики таҳлилӣ ва консепсияи истифодаи мошин барои коркарди рамзҳо, на танҳо рақамҳо.
         <p>Ада Лавлейс бо кори худ бо Чарлз Бэббиҷ дар компютери механикӣ, ки бо номи муҳаррики таҳлилӣ маъруф аст, машҳур шуд. Дар ёддоштҳои худ ба мақолае дар бораи муҳаррики таҳлилӣ, вай алгоритми ҳисобкунии рақамҳои Бернуллиро навишт, ки аввалин рамзи нармафзор ҳисобида мешавад, ки дар мошин кор мекунад.</p>
         <p>Гарчанде ки муҳаррики таҳлилӣ ҳеҷ гоҳ пурра сохта нашудааст, кори Ада Лавлейс нуқтаи ибтидоӣ барои рушди барномасозӣ ва илми информатика гардид. Дунёи ӯ дар бораи қобилиятҳои компютерҳо аз замони ӯ зиёдтар буд ва ба рушди ояндаи технология таъсири калон расонд.</p>
         <p>Ада Лавлейс дар синни 36-солагӣ даргузашт, аммо саҳми ӯ дар соҳаи илмҳои компютерӣ ва барномасозӣ барои илҳом бахшидан ва ба ҳаяҷон овардани зеҳни олимон ва муҳандисон дар саросари ҷаҳон идома медиҳад.</p>
     </li>

<li className="programmer">
   <strong>Билл Гейтс:&nbsp;&nbsp;</strong> Соҳибкор, барномасоз ва хайрхоҳи амрикоӣ, 28 октябри соли 1955 дар Сиэттл, Вашингтон таваллуд шудааст. Ӯ ҳамчун муассиси Microsoft ва яке аз шахсиятҳои калидӣ дар таҳияи компютерҳои фардӣ ва нармафзор шинохта шуд.
   <p>Билл Гейтс соли 1975 бо Пол Аллен Microsoft-ро таъсис дод. Мақсади онҳо сохтани системаи оператсионии компютерҳои фардӣ буд. Онҳо MS-DOS-ро таҳия ва бароварданд, ки баъдтар яке аз маъмултарин системаҳои оператсионии IBM PC ва компютерҳои мувофиқи он гардид.</p>
   <p>Ҳангоме ки саноати компютерӣ рушд мекард, Microsoft мавқеи пешсафиро ишғол намуда, версияҳои нави системаҳои оператсионӣ, аз қабили Windows ва нармафзорро ба монанди замимаҳои офисӣ интишор кард. Ба шарофати кӯшишҳои Гейтс, ширкат ба яке аз муваффақтарин ва бонуфузтарин дар ҷаҳон табдил ёфт.</p>
   <p> Илова бар кори худ дар Microsoft, Билл Гейтс бо кӯшишҳои хайрия ва хайрхоҳии худ тавассути Бунёди Билл ва Мелинда Гейтс машҳур аст. Вай дар соҳаи маориф, тандурустӣ ва рафъи камбизоатӣ захираҳои назаррасро сармоягузорӣ кардааст ва иштироки фаъолонаро дар лоиҳаҳои гуногуни иҷтимоӣ идома медиҳад.</p>
   <p>Билл Гейтс яке аз пешвоёни бонуфузтарин ва эътирофшуда дар ҷаҳони технологияҳои иттилоотӣ боқӣ мемонад ва саҳми ӯро дар рушди саноати компютерӣ ҳисоб кардан мумкин нест.</p>
</li>

<li className="programmer">
   <strong>Стив Возняк:&nbsp;&nbsp;</strong> Муҳандис, барномасоз ва соҳибкори амрикоӣ, 11 августи соли 1950 дар Сан-Хосе, Калифорния таваллуд шудааст. Ӯ ҳамчун муассиси Apple ва таҳиягари аввалин компютерҳои ин ширкат маъруф шуд.
   <p>Стив Возняк, ки аксар вақт "Воз" номида мешавад, дар таърихи аввали Apple нақши калидӣ бозид. Якҷоя бо Стив Ҷобс, ӯ яке аз аввалин компютерҳои фардӣ - Apple I-ро таҳия ва нашр кард, ки оғози достони афсонавии ширкат буд.</p>
   <p>Баъдтар Возняк компютери боз ҳам муваффақ ва маъмултар - Apple II-ро таҳия кард, ки яке аз аввалин компютерҳои фардӣ бо экрани ранга ва забони дарунсохташудаи барномасозӣ гардид. Apple II ба ширкат муваффақияти бузург овард ва ба таъсиси мавқеи он дар бозор мусоидат кард.</p>
   <p> Илова ба кори худ дар Apple, Стив Возняк иштироки фаъолонаро дар лоиҳаҳои гуногун дар соҳаи технологияҳои иттилоотӣ идома дод. Вай тарафдори таълим ва навовариҳои техникӣ аст ва бо ғояҳо ва дастовардҳои худ ба бисёриҳо илҳом бахшидааст.</p>
   <p>Стив Возняк яке аз пешвоёни мӯҳтарамтарин ва эътирофшудаи саноати компютерӣ боқӣ мемонад ва саҳми ӯро дар рушди технологияҳои компютерӣ аз ҳад зиёд арзёбӣ кардан мумкин нест.</p>
</li>

<li className="programmer">
   <strong>Деннис Ричи:&nbsp;&nbsp;</strong> Олими компютери амрикоӣ, 9 сентябри соли 1941 дар Бронкс, Ню Йорк таваллуд шудааст. Ӯ ҳамчун созандаи забони барномасозии Си ва иштирокчии таҳияи системаи оператсионии UNIX маъруф гашта, ӯро ба яке аз шахсиятҳои бонуфуз дар таърихи илми информатика табдил дод.
   <p>Деннис Ричи яке аз шахсиятҳои калидӣ дар рушди забонҳои барномасозӣ маҳсуб мешавад. Соли 1972 ӯ бо Кен Томпсон ҳамчун як қисми лоиҳаи таҳияи системаи оператсионии UNIX дар Labs Bell забони C-ро таҳия кард.</p>
   <p>Забони Си яке аз бонуфузтарин забонҳои барномасозӣ дар таърих гардид ва ба рушди саноати компютерӣ таъсири бузург расонд. Он барои бисёр забонҳои дигари барномасозӣ асос шуда, ба наслҳои барномасозон асосҳои барномасозии компютериро меомӯхт.</p>
   <p>Ба ғайр аз кори худ оид ба забони Си, Деннис Ричи инчунин дар таҳияи системаи оператсионии UNIX, ки яке аз маъмултарин ва бонуфузтарин системаҳои оператсионии таърихи компютер гардид, ширкат дошт.</p>
   <p>Саҳми Деннис Ричи дар рушди илмҳои компютерӣ ва технологияро аз ҳад зиёд арзёбӣ кардан мумкин нест. Кори ӯ ба ҷанбаҳои мухталифи саноати компютерӣ таъсири бузурге дошт ва ҳоло ҳам барномасозон ва муҳандисонро дар саросари ҷаҳон илҳом бахшидааст.</p>
</li>

<li className="programmer">
   <strong>Кен Томпсон:&nbsp;&nbsp;</strong> Барномасоз ва муҳандиси амрикоӣ, 4 октябри соли 1943 дар Ню Орлеан, Луизиана таваллуд шудааст. Ӯ ҳамчун ҳаммуаллифи забони барномасозии B ва офаринандаи забони барномасозии Go, ду забони муҳимтарин дар таърихи илмҳои компютерӣ шинохта шуд.
   <p>Дар соли 1969, Кен Томпсон, ки дар лабораторияи Bell кор мекард, дар якҷоягӣ бо Деннис Ричи забони барномасозии B-ро таҳия кард, ки пешгузаштаи забони Си буд. Забони B асоси таҳияи UNIX гардид ва воситаи муҳими таҳияи системаҳои оператсионӣ ва нармафзори барномавӣ гардид.</p>
   <p>Баъдтар, Кен Томпсон дар якҷоягӣ бо Роб Пайк ва Роберт Гризмер забони барномасозии Go-ро таҳия карданд, ки соли 2009 муаррифӣ шуда буд. Go бо мақсади таъмин намудани самаранокӣ ва соддагии барномасозӣ ва инчунин барои ҳалли баъзе мушкилоте, ки таҳиягарон ҳангоми таҳиягарон дучор меоянд, сохта шудааст. бо истифода аз забонҳои дигар.</p>
   <p>Забони Go бо сабаби соддагӣ, эътимоднокӣ ва самаранокии худ дар байни таҳиягарон зуд маъмул шуд. Он дар соҳаҳои гуногун, аз ҷумла веб-барномаҳо, хидматҳои абрӣ ва барномасозии системавӣ татбиқи васеъ пайдо кард.</p>
   <p>Кен Томпсон иштироки фаъолонаро дар таҳия ва дастгирии забони Go идома медиҳад ва саҳми ӯ дар рушди барномасозӣ ва технологияҳои иттилоотӣ бениҳоят назаррас боқӣ мемонад.</p>
</li>

<li className="programmer">
   <strong>Маргарет Хэмилтон:&nbsp;&nbsp;</strong> Олим ва барномасози амрикоӣ, 17 августи соли 1936 дар Пенсилвания таваллуд шудааст. Вай ҳамчун роҳбари як гурӯҳи барномасозон, ки нармафзорро барои барномаи Аполлон таҳия кардаанд ва дар иҷрои бомуваффақияти миссияҳои Аполлони NASA нақши калидӣ бозидааст, шинохта шудааст.
   <p>Маргарет Хэмилтон дар аввали солҳои 1960-ум ба Лабораторияи асбобсозии MIT ҳамроҳ шуд ва дар он ҷо дар таҳияи нармафзор барои парвозҳои киштиҳои кайҳонӣ кор мекард. Вай як гурӯҳи барномасозонро роҳбарӣ мекард, ки нармафзори системаро барои киштии кайҳонии Аполлон таҳия кардаанд, аз ҷумла нармафзори идоракунии парвоз ва фуруд.</p>
   <p> Кори вай барои муваффақияти миссияҳои Аполлон муҳим буд. Аз чумла, хангоми парвози «Аполлон 11» дар вакти фуруд омадани Мох проблемахои гайричашмдошт ба миён омаданд. Ба шарофати чандирӣ ва эътимоднокии нармафзоре, ки аз ҷониби Маргарет Хэмилтон ва гурӯҳи ӯ таҳия шудааст, экипаж тавонист фуруд омада, ба Замин баргардад.</p>
   <p>Пас аз кораш дар NASA, Маргарет Хэмилтон касби худро дар барномасозӣ ва технологияҳои иттилоотӣ идома дод. Вай пешрав дар соҳаи муҳандисии нармафзор шуд ва ҳамчунон илҳомбахши бисёр барномасозон ва муҳандисон мебошад.</p>
</li>

<li className="programmer">
   <strong>Ҷон МакКарти:&nbsp;&nbsp;</strong> Олим ва барномасози амрикоӣ, 4 сентябри соли 1927 дар Бостон, Массачусетс таваллуд шудааст. Ӯ ҳамчун созандаи забони барномасозии Lisp ва яке аз пешравони зеҳни сунъӣ шинохта шуд.
   <p>Ҷон МакКарти яке аз бузургтарин ақлҳо дар таърихи илмҳои компютерист. Соли 1958 ӯ забони барномасозии Lisp (Рӯйхати коркард)-ро офарид, ки яке аз аввалин ва бонуфузтарин забонҳои функсионалии барномасозӣ гардид. Lisp дар соҳаҳои гуногун, аз ҷумла тадқиқот дар зеҳни сунъӣ истифода мешуд.</p>
   <p>Ҷон МакКарти низ дар рушди зеҳни сунъӣ нақши калидӣ бозидааст. Вай истилохи «зехни сунъй»-ро ба вучуд оварда, акидахои сершумори назариявй ва амалиро кор карда баромад, ки ба ин илм асос гузоштанд. Кори ӯ дар мантиқ ва расмисозии донишҳо ба рушди минбаъдаи зеҳни сунъӣ таъсири бузург расонд.</p>
   <p>Дар тӯли фаъолияти худ Ҷон МакКарти барои дастовардҳои илмии худ мукофотҳои сершумор ва эътирофи зиёд гирифт. Саҳми ӯ дар рушди илмҳои компютерӣ ва зеҳни сунъӣ бениҳоят назаррас боқӣ монда, олимон ва муҳандисонро дар саросари ҷаҳон илҳом бахшида истодааст.</p>
</li>

<li className="programmer">
   <strong>Бьярн Штроуструп:&nbsp;&nbsp;</strong> Олим ва барномасози Дания, 30 декабри соли 1950 дар Орхус, Дания таваллуд шудааст. Ӯ ҳамчун созандаи забони барномасозии C++ - яке аз забонҳои бонуфузтарин ва васеъ истифодашавандаи барномасозӣ шинохта шуд.
   <p>Бярн Строуструп забони барномасозии C++-ро дар ибтидои солҳои 1980 дар лабораторияи Bell дар ИМА таҳия карда буд. Он ҳамчун тавсеаи забони барномасозии C бо мақсади илова кардани имкониятҳои барномасозии ба объект нигаронидашуда ва баланд бардоштани самаранокӣ ва чандирии таҳияи нармафзор таҳия шудааст.</p>
   <p>Забони C++ ба таври васеъ истифода мешуд ва дар бисёр соҳаҳо, аз ҷумла барномасозии система, таҳияи барномаҳо, бозиҳо, замимаҳои мобилӣ ва ғайра истифода мешуд. Он бо сабаби самаранокӣ, чандирӣ ва қудрати худ яке аз маъмултарин ва серталаб забонҳои барномасозӣ гардид.</p>
   <p>Bjarne Stroustrup иштироки фаъолонаро дар таҳияи C++ идома медиҳад ва яке аз шахсиятҳои калидӣ дар ҷомеаи таҳиягарон мебошад. Асарҳо ва ғояҳои ӯ ҳамчунон ба рушди барномасозӣ ва илми информатика таъсир мерасонанд.</p>
</li>

<li className="programmer">
   <strong>Гвидо ван Россум:&nbsp;&nbsp;</strong> барномасози голландӣ, 31 январи соли 1956 дар Гаагаи Нидерландия таваллуд шудааст. Ӯ ҳамчун офаринандаи забони барномасозии Python - яке аз маъмултарин ва васеъ истифодашавандаи забонҳои барномасозӣ дар ҷаҳон шинохта шуд.
   <p>Гвидо ван Россум дар охири солҳои 1980-ум ба коркарди Python оғоз кард ва версияи аввалини ин забон дар соли 1991 бароварда шуд. Python бо ҳадафи пешниҳоди як забони содда, вале пурқуввати барномасозӣ, ки метавонад самаранокӣ ва роҳатиро таъмин кунад, сохта шудааст. дар таҳияи нармафзор.</p>
   <p>Python ба забони васеъ истифодашавандаи барномасозӣ дар соҳаҳои гуногун, аз ҷумла таҳияи веб, ҳисоббарории илмӣ, зеҳни сунъӣ, таҳлили додаҳо, автоматизатсия ва ғайра табдил ёфт. Он бо синтаксиси содда ва фаҳмо фарқ мекунад, ки онро барои барномасозони навкор хеле дастрас ва барои таҳиягарони ботаҷриба қавӣ мегардонад.</p>
   <p>Гуидо ван Россум дар таҳияи Python фаъолона иштирок мекунад ва яке аз таҳиягарони асосии он боқӣ мемонад. Саҳми ӯро дар барномасозӣ ва технологияҳои иттилоотӣ аз ҳад зиёд арзёбӣ кардан мумкин нест ва кори ӯ идома медиҳад, ки бисёре аз таҳиягаронро дар саросари ҷаҳон илҳом бахшад.</p>
</li>

<li className="programmer">
   <strong>Ларри Пейҷ ва Сергей Брин:&nbsp;&nbsp;</strong> Соҳибкорон ва барномасозони амрикоӣ, мутаносибан 26 марти соли 1973 (Ларри Пейҷ) ва 21 августи соли 1973 (Сергей Брин) таваллуд шудаанд. Онҳо ҳамчун муассисони Google - яке аз бузургтарин ва бонуфузтарин ширкатҳои ҷаҳон шинохта шуданд, ки навовариҳои он дар системаҳои ҷустуҷӯӣ ва технологияҳои интернетӣ роҳи дастрасии иттилоотро дар саросари ҷаҳон тағйир доданд.
   <p>Ларри Пейҷ ва Сергей Брин дар Донишгоҳи Стэнфорд вохӯрданд, ки ҳарду дар он ҷо илмҳои компютериро меомӯзанд. Лоиҳаи муштараки онҳо барои эҷоди як системаи ҷустуҷӯии муассиртар боиси таъсиси Google дар соли 1998 шуд. Онҳо алгоритми ҷустуҷӯеро таҳия карданд, ки саҳифаҳои вебро аз рӯи аҳамияти онҳо гурӯҳбандӣ карда, боиси беҳтар шудани сифати натиҷаҳои ҷустуҷӯ гардид.</p>
   <p>Google бо сабаби бархӯрди инноватсионии худ ба ҷустуҷӯи иттилоот ва пешниҳоди доираи васеи хидматҳои онлайн, аз қабили Gmail, Google Maps, YouTube ва ғайра яке аз муваффақтарин лоиҳаҳои интернетӣ дар таърих гардид.</p>
   <p>Ларри Пейҷ ва Сергей Брин дар таҳияи Google ва дигар лоиҳаҳои марбут ба технологияҳои иттилоотӣ фаъолона иштирок мекунанд. Саҳми онҳо дар саноати муосири интернет бебаҳост ва онҳо шахсиятҳои муҳим дар ҷаҳони соҳибкорӣ ва технология боқӣ мемонанд.</p>
</li>

<li className="programmer">
   <strong>Андерс Ҳейлсберг:&nbsp;&nbsp;</strong> Барномасози Дания, 2 декабри соли 1960 дар Копенгаген, Дания таваллуд шудааст. Ӯ ҳамчун сармеъмори забони барномасозии C# ва таҳиягари TypeScript, ду забони муҳимтарини барномасозӣ дар ҷаҳони технологияҳои муосири иттилоотӣ шинохта шудааст.
   <p>Андерс Ҳейлсберг дар таҳияи якчанд забонҳои асосии барномасозӣ ширкат дошт. Дар соли 1983 ӯ ба ширкати Borland ҳамроҳ шуд ва дар онҷо Турбо Паскалро таҳия намуд - яке аз аввалин муҳитҳои ҳамгирошудаи рушди забони Паскал. Турбо Паскал васеъ истифода шуд ва дар солҳои 1980 ба рушди барномасозӣ таъсири назаррас расонд.</p>
   <p>Дар соли 1996 Андерс Ҳейлсберг ба Microsoft ҳамроҳ шуд ва дар он ҷо меъмори асосии забони барномасозии C# шуд. C# ҳамчун забони барномасозии ба объект нигаронидашуда таҳия шудааст, ки ба платформаи .NET нигаронида шудааст ва зуд ба яке аз маъмултарин забонҳои барномасозӣ дар ҷаҳон табдил ёфт.</p>
   <p>Ба ғайр аз кор дар C#, Андерс Ҳейлсберг инчунин таҳиягари TypeScript - забони барномасозӣ мебошад, ки имкониятҳои JavaScript-ро тавассути илова кардани чопкунии статикӣ ва дигар хусусиятҳо барои таҳияи барномаҳои калон ва мураккаб васеъ мекунад.</p>
   <p>Саҳми Андерс Ҳейлсберг дар рушди забонҳои барномасозӣ ва технологияҳои иттилоотӣ бузург аст ва кори ӯ идома медиҳад, ки бисёре аз таҳиягаронро дар саросари ҷаҳон илҳом бахшад.</p>
</li>

<li className="programmer">
   <strong>Брендан Эйч:&nbsp;&nbsp;</strong> Барномасози Канада, 27 июли соли 1961 дар Ванкувери Канада таваллуд шудааст. Вай ҳамчун офаринандаи забони барномасозии JavaScript - яке аз васеъ истифодашавандаи забонҳои барномасозӣ дар ҷаҳон шинохта шуд, ки ҷузъи асосии таҳияи веб ва ҳамкории динамикӣ дар саҳифаҳои веб гардид.
   <p>Брендан Эйч дар соли 1995 ба кор дар JavaScript оғоз кард, вақте ки ӯро аз Netscape Communications барои сохтани забони барномасозӣ барои браузери Netscape Navigator киро карданд. Вай JavaScript-ро дар давоми 10 рӯз таҳия кард ва ин забон бори аввал дар Netscape Navigator 4.0 соли 1996 татбиқ карда шуд.</p>
   <p>JavaScript барои илова кардани интерактивӣ ва мундариҷаи динамикӣ ба саҳифаҳои веб сохта шудааст, ки ба таҳиягарон имкон медиҳад, ки веб-барномаҳои бештар динамикӣ ва функсионалӣ эҷод кунанд. Дар тӯли солҳо, JavaScript ба яке аз забонҳои асосии барномасозӣ барои веб табдил ёфт ва дар пешрафти технологияҳои веб қарор дорад.</p>
   <p>Брендан Эйч иштироки фаъолонаро дар таҳия ва стандартизатсияи JavaScript идома медиҳад ва кори ӯ дар ин соҳа барои ҷаҳони рушди веб ва технологияҳои иттилоотӣ бениҳоят муҳим боқӣ мемонад.</p>
</li>

<li className="programmer">
   <strong>Ҷеймс Гослинг:&nbsp;&nbsp;</strong> Барномасоз ва олими Канада, 19 майи соли 1955 дар Калгари, Канада таваллуд шудааст. Ӯ ҳамчун созандаи забони барномасозии Java - яке аз маъмултарин ва васеъ истифодашавандаи забонҳои барномасозӣ дар ҷаҳон шинохта шуд, ки барои таҳияи навъҳои гуногуни нармафзор замина гузошт.
   <p>Ҷеймс Гослинг дар миёнаҳои солҳои 1990-ум дар Sun Microsystems, вақте ширкат дар ҷустуҷӯи роҳҳои такмил додани барномасозӣ барои системаҳои дохилшуда ба кор дар бораи забони Java оғоз кард. Java бо дарназардошти талабот барои интиқол, кор ва амният таҳия шудааст ва ба зудӣ барои таҳияи барномаҳои веб, замимаҳои мобилӣ, системаҳои бузурги корпоративӣ ва бисёр дигар соҳаҳо маъмул шуд.</p>
   <p>Java соли 1995 муаррифӣ шуда буд ва бо сабаби соддагӣ, эътимоднокӣ ва қудрати худ зуд маъруфият пайдо кард. Он яке аз забонҳои асосии барномасозӣ дар муҳити корпоративӣ гардид ва дар соҳаҳои гуногун, аз ҷумла молия, телекоммуникатсия, тандурустӣ ва ғайра васеъ истифода мешавад.</p>
   <p>Ҷеймс Гослинг дар таҳияи Java фаъолона иштирок мекунад ва яке аз коршиносони пешбари соҳаи барномасозӣ ва технологияҳои иттилоотӣ мебошад. Кори ӯ дар Java ба рушди саноати компютерӣ таъсири бузург расонд ва дар ҷаҳони таҳияи нармафзор осори худро мегузорад.</p>
</li>


<li className="programmer">
   <strong>Марк Зукерберг:&nbsp;&nbsp;</strong> Барномасоз ва соҳибкори амрикоӣ, 14 майи соли 1984 дар Уайт Плейнз, Ню Йорк таваллуд шудааст. Ӯ ҳамчун муассис ва мудири кулли Фейсбук, яке аз бузургтарин ва бонуфузтарин шабакаҳои иҷтимоӣ дар ҷаҳон шинохта шуд.
   <p>Марк Зукерберг барномасозиро аз хурдсолӣ оғоз кард ва дар замони худ дар Донишгоҳи Ҳарвард прототипи як шабакаи иҷтимоиро таҳия кард, ки баъдан ба Facebook табдил ёфт. Фейсбук соли 2004 таъсис ёфта, ба зудӣ дар байни донишҷӯёни донишгоҳҳо ва баъдан дар байни омма маъруфият пайдо кард.</p>
   <p>Таҳти роҳбарии Зукерберг, Facebook аз идеяи оддии коллеҷ ба як бузургҷуссаи байналмилалии васоити ахбори иҷтимоӣ бо миллиардҳо корбарон дар саросари ҷаҳон табдил ёфт. Вай дар рушди платформа нақши калидӣ бозид, хусусиятҳои навро ҷорӣ кард ва тиҷорати ширкатро дар бозорҳо ва соҳаҳои гуногун густариш дод.</p>
   <p>Илова бар ин, Марк Зукерберг дар ташаббусҳои гуногуни ҷамъиятӣ ва лоиҳаҳои хайриявӣ, аз ҷумла дар соҳаҳои маориф ва тиб фаъолона иштирок мекунад. Таъсири ӯ ба ҷаҳони технологияҳои иттилоотӣ ва ҳамкории иҷтимоӣ аз ҳад зиёд гуфтан душвор аст ва ӯ яке аз соҳибкорони маъруф ва бонуфузтарин дар ҷаҳон боқӣ мемонад.</p>
</li>

<p>Дар ин маҷмӯа, мо саҳми назарраси барномасозони барҷастаро, ки ҷаҳони технология ва илми иттилоотиро ташаккул додаанд, омӯхтаем. Аз эҷоди забонҳои барномасозии инқилобӣ то таҳияи нармафзор ва системаҳои тағирёбандаи бозӣ, ин афрод дар манзараи илми информатика осори фаромӯшнашаванда гузоштанд ва идома медиҳанд, ки наслҳои барномасозон ва муҳандисонро дар саросари ҷаҳон илҳом бахшанд. Корҳои дурандешона ва фидокории онҳо барои навоварӣ ва пешрафтҳои бешумор дар асри рақамӣ роҳ кушода, мероси онҳоро ҳамчун пешрав дар соҳаи технологияҳои иттилоотӣ мустаҳкам карданд.</p>

  </ul>
  
  <b><p>* Матн бо ёрии тарчумон навишта шудааст. Агар шумо хатое пайдо кунед, лутфан ба мо хабар диҳед *</p></b>
    
    <div className='ads-container'>  
  {/*  реклама  */}
</div>
    </div>
  )
}

export default TjTechTitans;